{
  "language": "Taal",
  "intro": "GC Tools biedt alle tools die je nodig hebt als geocacher (bijna). Veel gebruikte tools zoals <a href='/wordvalue'>Woordwaarde<a>, <a href='/codebook'>Codebook<a>, <a href='/rotciphers'>ROT13<a>, <a href='/printlog'>Logrollen printen<a> of <a href='/sudokusolv'>Sudoku's oplossen<a>. Maar ook nieuwe tools zoals de <a href='/htmlparser'>HTML Scanner<a>. En nog heel veel andere tools. Tips voor het oplossen geocaching puzzels vind je bij <a href='./howto'>Tips</a>.",

  "errors": {
    "generic": "Er ging iets mis. Probeer het opnieuw.",
    "noinput": "Er zijn geen gegevens ingevoerd",
    "nocoords": "Geen coördinaten ingevoerd. Voer een coördinaat in.",
    "incorrectcoords": "Fout bij converteren coordinaat, controleer het ingevoerde coordinaat en het geselecteerde formaat.",
    "invalidinput": "Invoer kan niet worden vertaald. Controleer het geselecteerde type invoer.",
    "noresult": "Geen resultaten gevonden",
    "cannotparse": "Invoer ongeldig",
    "unknowninput": "Onbekende invoer ",
    "loadingimage": "Fout bij het laden van de afbeelding",
    "loadingfile": "Fout bij het laden van het bestand",
    "notanumber": "Invoer is geen getal",
    "notbinary" : "Ongeldig binair getal",
    "notdecimal" : "Ongeldig decimaal getal",
    "nothexadecimal": "Ongeldig hexadecimaal getal",
    "invalidchecksum": "Let op: Checksum klopt niet"
  },

  "labels": {
    "from": "Van",
    "to": "Naar",
    "message": "Bericht",
    "coordinate": "Coördinaat",
    "coordformat": "Coördinaat formaat",
    "distance": "Afstand",
    "angle": "Richting",
    "radius": "Straal",
    "variable": "Variabele",
    "color": "Kleur",
    "option": "Waardes",
    "point": "Punt",
    "surface": "Oppervlakte",
    "center": "Middelpunt",
    "circumference": "Omtrek",
    "result": "Resultaat",
    "alphabet": "Alfabet",
    "search": "Zoekterm",
    "sum": "Som",
    "count": "Aantal",
    "perc": "Percentage",
    "number": "Nummer",
    "name": "Naam",
    "date": "Datum",
    "time" : "Tijd",
    "welcome": "GC Tools",
    "whatsnew": "Wat is er nieuw",
    "featured": "Uitgelicht",
    "help": "Help ",
    "moreinfo": "Lees verder",
    "letsgo": "Aan de slag",
    "alltools" : "Alle tools"
  },

  "buttons": {
    "convert": "Converteer",
    "calc": "Bereken",
    "search": "Zoek",
    "format": "Formatteer",
    "reset": "Reset",
    "cancel": "Annuleer",
    "save": "Opslaan",
    "get": "Haal op",
    "check": "Controleer",
    "apply": "Toepassen",
    "show": "Tonen",
    "showtab": "Toon/verberg tabel",
    "showres": "Toon/verberg resultaat",
    "original": "Origineel",
    "count": "Tel",
    "sum": "Totalen",
    "showtable": "Toon tabel",
    "undo": "Ongedaan maken",
    "encode": "Codeer",
    "decode": "Decodeer",
    "download": "Download",
    "try" : "Probeer alles",
    "prev" : "Vorige",
    "next" : "Volgende"  },

  "colors": {
    "white": "Wit",
    "black": "Zwart",
    "red": "Rood",
    "blue": "Blauw",
    "green": "Groen",
    "cyan": "Cyaan",
    "magenta": "Magenta",
    "yellow": "Geel",
    "brown": "Bruin",
    "grey": "Grijs",
    "darkgrey": "Donkergrijs"
  },

  "languages": {
    "english": "Engels",
    "dutch": "Nederlands",
    "german": "Duits",
    "french": "Frans",
    "spanish": "Spaans"
  },

  "highlights": {
    "bold": "Vet",
    "upper": "Hoofdletters"
  },

  "menu": {
    "home": "Home",
    "coordinates": "Coördinaten",
    "texttools": "Tekst",
    "codes": "Codes",
    "imagetools": "Afbeeldingen",
    "mathtools": "Rekenen",
    "comptools": "Programmeren",
    "other": "Diversen",
    "help": "Help",
    "howto": "Tips",
    "about": "Info"
  },

  "coordinates": {
    "intro": "Een verzameling tools om coördinaten te converteren en te berekenen. Alle tools ondersteunen een groot aantal notaties en coördinaatsystemen. De tools berekenen projecties, lijnen, driehoeken en circles. Er is een tool om kaarten te maken of incomplete coördinaten te plotten. What3words wordt uitgebreid ondersteund. Het is ook mogelijk Reverse Wherigo caches op te lossen."
  },

  "codes": {
    "intro": "Geheimschriften (of cijfers) gebruiken sleutels of transpositie om een bericht te coderen. Er zijn 60 verschillende cijfers beschikbaar. Codes zijn een simpeler manier, er wordt geen sleutel bij gebruikt. Het vinden van de juiste code is niet altijd eenvoudig. De zoektool of de speciale fonts kunnen daarbij helpen. Weerstandscode, segmentcode en decabit zijn codes voor speciale doeleinden."
  },

  "texttools": {
    "intro": "Tools voor tekst. Het berekenen van woordwaardes. Het converteren van ASCII of andere codes. Een tool om tekst te analiseren. Slimme substitutie helpt met het kraken van geheimschriften. Converteren van tekst van en naar nummers. Het wisselen van toetsenborden zoals Dvorak. En een tool om woorden door elkaar te husselen."
  },

  "imagetools": { 
    "intro": "Tools om afbeeldingen snel te bewerken of te scannen. De EXIF scanner toont de gegevens van een afbeelding. De kleurenkiezer geeft de details van een geseleteerde kleur. De editor kan snel een gebied vullen, helderheid of contrast aanpassen of een filter toepassen. Er is een tool om een afbeelding te genereren uit getallen. Transformeren doet rare dingen als een afbeelding gedeeltelijk spiegelen of verschuiven. Tekst zoeker vindt mogelijke teksten in willekeurige files, zoals afbeeldingen."
  },

  "mathtools": {
    "intro": "Rekenkundige en wiskundige tools. Decimalen van wiskundige constantes zoals pi. Rekenen met gigantische binaire, octale, hexadecimale of decimale getallen. Priemgetallen, GGD en KGV, ontbinden in priemfactoren. Enkele bekende reeksen zoals Fibonacci of Hailstone. Het oplossen van cryptaritmes."
  },

  "comptools" : {
    "intro": "Een verzameling tools die gebruikt worden door computers en bij het programmeren daarvan. Diverse manieren om tekst, getallen of binaire data te coderen. Digital encrypties en hashes worden ondersteund. Tenslotte kunnen enkele zogenaamde esoterische talen (esolangs) worden uitgevoerd."
  },

  "othertools" : {
    "intro": "Diverse tools voor van alles en nog wat. Oplossers voor Sudoku en Mastermind. Conversie van honderden eenheden. Rekenen met datums. Random generator. Tabellen van het periodiek systeem, alle landen van de wereld, de staten van de VS, provincies van Europese landen en DNA codes"
  },
  
  "alltools" : {
    "title" : "Zoek in alle tools",
    "long" : "Doorzoek alle tools, geheimschriften, codes, fonts of toon alle tools.",
    "showall": "Toon alle tools"
  },

  "ciphers": {
    "title" : "Geheimschriften",
    "long": "<p>Geheimschriften of beter gezegd Cijfers coderen berichten door substitutie en transpositie. Bij substitutie worden letters of combinaties van letters vervangen door iets anders. Bij transpositie wordt de volgorde van de letters aangepast. Cijfers die maar één alfabet gebruiken zijn eenvoudig te kraken, zoals ROT13 of Atbash. Cijfers die meerdere alfabetten gebruiken zijn bijvoorbeeld Vigenere en Beaufort. Sommige cijfers coderen één letter per keer, maar veel werken ook met bigrams van twee letters, zoals Polybius, Bazeries en Condi. Cijfers die transpositie toepassen om de volgorde van de letters te veranderen zijn er ook in allerlei variaties zoals Railfence, Cadenus or Skip. De meest complexe en dus moeilijk te kraken cijfers gebruiken een combinatie van al deze technieken. Bifid, Trifid en Digrafid zijn daarvan enkele voorbeelden.</p><p>Selecteer een geheimschrift uit de lijst. Vul het bericht in en codeer of decodeer. In de meeste gevallen volstaan de standaardinstelling. In expert mode kunnen die worden aangepast.</p>",
    "cipher": "Geheimschrift",
    "selcipher": "Selecteer cipher",
    "keepcase": "Behoud kleine letters",
    "keepdiacrit": "Behoud diakrieten (vervang niet door normale letters)",
    "keepunknown": "Behoud letters die niet voorkomen in het alfabet",
    "replacechars": "Vervang de letters zoals hieronder opgegeven",
    "formatoutput": "Verdeel de output in blokken zoals hieronder opgegeven",
    "expertmode": "Expert mode",
    "hideexpertmode": "Standaard mode",
    "gensq": "Genereer vierkant",
    "genalp": "Genereer alfabet",
    "errdec": "Bericht kan niet worden gedecodeerd. Er gaat iets fout.",
    "errenc": "Bericht kan niet worden gecodeerd. Er gaat iets fout.",
    "sep": "Scheidingsteken",
    "bs": "Lengte blokken",
    "repl": "Vervangingen",
    "adfgvx": {
      "info": "De ADFGX(V) cijfer gebruikt een Polybiusvierkant (van 5 bij 5 of 6 bij 6). Daarna worden de kolommen verplaatst volgens de gegeven sleutel. Hierdoor wordt de code gefractioneerd.",
      "k1": "Vierkant",
      "k2": "Transpositiesleutel"
    },
    "affine": {
      "info": "De Affine cijfer is een substitutiecifjer. Het gebruikt de functie y=ax + b. De waarde van A moet een co-priem zijn met de lengte van het alfabet.",
      "k1": "A (groter dan 1)",
      "k2": "B (groter dan 0)"
    },
    "amsco": {
      "info": "De AMSCO cijfer is een substitutiecijfer. Het bericht wordt in een tabel geschreven om en om in blokken van 1 en 2. De transpositiesleutel wordt gebruikt om de kolommen te verplaatsen.",
      "k1": "Transpositiesleutel"
    },
    "atbash": {
      "info": "Atbash is een simpele substitutiecijfer. Elke letter wordt vervangen door die in het omgekeerde alfabet. Dus A=Z, B=Y, enzovoorts."
    },
    "atomtom": {
      "info": "A-tom-tom code is een simpele subtitutiecijfer. Elke letter wordt vervangen door een combinatie van forward / and backward \\ slashes."
    },
    "autokey": {
      "info": "Een autokeycijfer is een polyalfabetische cijfer (er worden meerdere alfabetten gebruikt). In eerste instantie wordt begonnen met de gegeven sleutel, die steeds wordt aangevuld met het gecodeerde bericht. Deze autokey gebruikt de Vigenerecijfer.",
      "k1": "Sleutel"
    },
    "bacon": {
      "info": "Elk karakter wordt vervangen door 5 letters (normaliter A en B). In versie 1 wordt dezelfde combinatie gebruikt voor I/J en U/V. Versie 2 is uniek voor het hele alfabet. Je kan de Bacon cijfer ook in een willekeurige tekst verstoppen door voor A en B een ander font te gebruiken of te wisselen tussen hoofd- en kleine letters.",
      "k1": "Versie (1 of 2)",
      "k2": "Vervang A door",
      "k3": "Vervang B door"
    },
    "bazeries": {
      "info": "De Bazeries cijfer codeert 2-letters per keer. Het gebruikte alfabet is 25 of 36 letters. Er worden twee vierkanten gebruikt. Het eerste vierkant is een verticaal geordend alfabet. Het tweede vierkant wordt gegenereerd met de numerieke sleutel. De numerieke sleutel wordt ook gebruikt voor transpositie van het gecodeerde bericht. Beide vierkanten kunnen worden aangepast. J wordt vervangen door I, maar in expert mode kan dit worden aangepast, bijvoorbeeld V wordt vervangen door I",
      "k1": "Vierkant 1",
      "k2": "Vierkant 2",
      "k3": "Transpositiesleutel (numeriek)"
    },
    "beaufort": {
      "info": "De Beaufort cijfer, (genoemd naar zijn bedenker by Sir Francis Beaufort), is een substitutiecijfer vergelijkbaar met de Vigenere cijfer, met een enigszins aangepast tableau. De sleutel is verplicht",
      "k1": "Sleutel (verplicht)"
    },
    "bibibinary": {
      "info": "Bibi-binary is systeem voor het coderen van getallen. Het getal wordt geconverteerd naar hexadecimaal en dan omgezet naar een grappig klinkende tekst. Alleen nummers kunnen worden gecodeerd."
    },
    "bifid": {
      "info": "De Bifid cijfer gebruikt een standaard Polybiusvierkant. Op het resultaat wordt een transpositie uitgevoerd met de gegeven sleutel. Hierdoor treedt fractionering op. Het resultaat daarvan wordt weer vertaald naar tekst met hetzelfde Polybiusvierkant.",
      "k1": "Transpositiesleutel"
    },
    "burrowswheeler": {
      "info": "De Burrow Wheeler cijfer is transpositie cijfer. Het werkt met een zogenaamd end-of-file karakter. Dit karakter is noodzakelijk.",
      "k1": "End-of-file karakter"
    },
    "cadenus": {
      "info": "De Cadenus cijfer is een transpositie cijfer. De sleutel regelt de volgorde van de kolommen, maar ook het startpunt van elke kolom. Het bericht moet altijd 25 keer de lengte van de sleutel lang zijn.",
      "k1": "Transpositiesleutel"
    },
    "caesar": {
      "info": "De Caesar cijfer is een klassieke substitutiecijfer. Elke letter wordt vervangen door de letter die een aantal plaatsen verder in het alfabet ligt. De default verschuiving is 13. ROT13 is hetzelfde als een Caesarcijfer met verschuiving 13.",
      "k1": "Verschuiving"
    },
    "rot13": {
      "info": "De Caesar cijfer is een klassieke substitutiecijfer. Elke letter wordt vervangen door de letter die een aantal plaatsen verder in het alfabet ligt. De default verschuiving is 13. ROT13 is hetzelfde als een Caesarcijfer met verschuiving 13.",
      "k1": "Verschuiving"
    },
    "chaocipher": {
      "info": "De chaocijfer is een polyalfabetische cijfer, waarbij steeds een nieuw alfabet wordt gegenereerd. Hij is uitgevonden in 1918 door John F. Byrne.",
      "k1": "Linker startalfabet",
      "k2": "Rechter startalfabet"
    },
    "collon": {
      "info": "De Colloncijfer vertaalt letters naar bigrams met behulp van een Polybiusvierkant. Het bigram ontstaat door het combineren van de eerste/laatste letter in de rij/kolom. De periode wordt vervolgens gebruikt voor transpositie, waardoor fractionering optreedt.",
      "k1": "Volgorde van bigrams:",
      "k2": "Polybiusvierkant",
      "k3": "Periode",
      "s1": {
        "rfcl": "Rij eerst, kolom laatst",
        "rlcl": "Rij laatst, kolom laatst",
        "rfcf": "Rij eerst, kolom eerst",
        "rlcf": "Rij laatst, kolom eerst",
        "clrl": "Kolom laatste, rij laatst",
        "clrf": "Kolom laatste, rij eerst",
        "cfrf": "Kolom eerst, rij eerst",
        "cfrl": "Kolom eerst, rij laatst"
      }
    },
    "columnartransposition": {
      "info": "Kolomtranspositie schrijft het bericht onder elkaar in regels. Vervolgens worden de kolommen verplaatst volgens de gebruikte sleutel. Het resultaat wordt kolom na kolom opgeschreven.",
      "k1": "Transpositiesleutel"
    },
    "condi": {
      "info": "De Condi cijfer (condi staat voor consecutive digrams) gebruikt steeds twee letters (digrams) voor het bepalen van de verschuiving voor de volgende letter. De cijfer is verrassend lastig te kraken.",
      "k1": "Sleutel voor het cijferalfabet",
      "k2": "Start met verschuiving"
    },
    "digrafid": {
      "info": "De Digrafid cijfer gebruikt een tableau gebaseerd op twee alfabetten van 3 bij 9 en 9 bij 3 (27 tekens - ABCDEFGHIJKLMNOPQRSTUVWXYZ#).",
      "k1": "Sleutel tableau 1",
      "k2": "Sleutel tableau 2",
      "k3": "Periode (verplicht)"
    },
    "foursquare": {
      "info": "De Foursquare cijfer is vervangt digrams (2 letters) op basis van twee Polybiusvierkanten.",
        "k1": "Vierkant 1",
        "k2": "Vierkant 2"
    },
    "gcid": {
      "info": "Geocache id, ookwel base 31, vertaalt het geocache id (een nummer) naar de geocache code, zoals GC001. Meerdere id's of codes kunnen worden ingevoerd.."
    },
    "goldbug": {
      "info": "De Goldbug cijfer is een simpele substitutiecijfer die te vinden was in een kort verhaal van Edgar Allan Poe uit 1843."
    },
    "graycode": {
      "info": "De Gray Code of ook wel de reflected binary code (RBC)is genoemd naar Frank Gray. Het is een binaire nummering waarbij twee opeenvolgende cijfers steeds maar 1 bit verschillen. Alleen coderen van nummers is mogelijk.",
      "k1": "Aantal bits"
    },
    "gromark": {
      "info": "De Gromark cijfer gebruikt de sleutel om eerst het alfabet te herordenen en vervolgens dezelfde sleutel voor transpositie. De primer wordt gebruikt om de verschuiving van elke letter te bepalen.",
      "k1": "Sleutel (verplicht)",
      "k2": "Primer (5 cijfers)"
    },
    "gronsfeld": {
      "info": "De Gronsfeld cijfer is een Vigenere cijfer met een numerieke sleutel. De sleutel is verplicht.",
      "k1": "Sleutel (numeriek)"
    },
    "kennycode": {
      "info": "De Kenny code is gebaseerd het gemompel van het gelijknamige Southpark karakter. Elke letter wordt vervangen door een combinatie van m, p en f (fff wordt niet gebruikt)."
    },
    "monomedinome": {
      "info": "De Monome-dinome cijfer gebruikt een alfabet van 24 letters. De eerst sleutel wordt gebruikt om een 3x8 rechthoek te genereren. De tweede sleutel wordt gebruikt om rijen en kolommen te nummmeren.",
      "k1": "Sleutel voor het alfabet",
      "k2": "Sleutel voor rij/kolom (min 10 letters)"
    },
    "morbit": {
      "info": "Morbit vertaalt het bericht eerst naar Morse. De resulterende code wordt opgedeeld in koppels van 2 tekens, die steeds met behulp van de sleutel (9 letters) worden omgezet in een cijfer.",
      "k1": "Sleutel (9 letters)"
    },
    "morse": {
      "info": "Morse code is bekend. Letters worden met korte of lange piepjes (. en -) gecodeerd voor transmissie via de ether. Deze morse doet ook cijfers en leestekens."
    },
    "myszkowski": {
      "info": "De Myszkowski cijfer is een kolom transpositie gebruikmakend van een sleutel met dubbele letters. Bij de transpositie worden gelijke letters van links naar rechts gelezen en vervolgens per kolom.",
      "k1": "Transpositiesleutel (met dubbele letters)"
    },
    "nesw": {
      "info": "De NESW of NEWS cipher gebruikt een vierkant. Om te coderen wordt een windrichting gekozen (N, E, S, W, NE, SE, SW oF NW) en de letter genomen die daar staat in het vierkant. Om te decoderen wordt de tegenovergestelde richting gekozen.",
      "k1": "Vierkant"
    },
    "nicodemus": {
      "info": "De Nicodemus cijfer voert eerst een transpositie uit met de sleutel. Op het resultaat wordt met dezelfde sleutel een Vigenere cijfer toegepast.",
      "k1": "Sleutel"
    },
    "nihilist": {
      "info": "De Nihilist cijfer is een variant op de Polybius cipher. De eerste sleutel wordt gebruikt om het Polybiusvierkant te genereren. De tweede sleutel wordt ook gecodeerd en vervolgens bij elke letter opgeteld.",
      "k1": "Polybius vierkant",
      "k2": "Sleutel om op te tellen"
    },
    "nihilisttransposition": {
      "info": "De Nihilist transpositiecijfer is een kolomtranspositie gevolgd door een rijtranspositie. Voor beide wordt dezelfde sleutel gebruikt. Het resultaat wordt vervolgens per kolom of per rij uitgeschreven. De lengte van het bericht moet een kwadraat van de sleutellengte zijn. (Deze cijfer heeft niks te maken met de Nihilist cijfer.)",
      "k1": "Transpositiesleutel",
      "k2": "Per kolom / per rij",
      "s1": {
        "row": "Rij",
        "col": "Kolom"
      }
    },
    "onetimepad": {
      "info": "De One Time Pad gebruikt een sleutel met dezelfde lengte als het bericht. Daardoor treedt er geen herhaling op en is elke vorm van frequentieanalyse kansloos. De One Time Pad is dan ook de enige echt onbreekbare cijfer, mits er geen herhaling in de sleutel zitten en de sleutel maar één keer wordt gebruikt.",
      "k1": "Pad"
    },
    "phillips": {
      "info": "De Phillips cijfer is een variant op de Polybiuscijfer. De rijen en kolommen van het vierkant worden verschoven zodat er 8 verschillende vierkanten ontstaan. De 8 vierkanten worden na elkaar gebruikt.",
      "k1": "Polybius vierkant"
    },
    "playfair": {
      "info": "De Playfair cijfer codeert bigrams (2 letters) per keer met een Polybiusvierkant. Het is één van de klassieke cijfers en werd in 1854 uitgevonden door Sir Charles Wheatstone.",
      "k1": "Polybius vierkant"
    },
    "polybius": {
      "info": "De Polybiuscijfer gebruikt een vierkant (het Polybiusvierkant) van 5x5 (of 6x6). De labels van de rijen en kolommen zijn standaard 12345, maar dit kan worden aangepast. Het Polybiusiverkant wordt in veel andere cijfers gebruikt. Het vierkant is een klassieker die teruggaat naar de Oude Grieken.",
      "k1": "Vierkant",
      "k2": "Rijen",
      "k3": "Kolommen"
    },
    "pollux": {
      "info": "De Pollux cijfer vertaalt het bericht eerst naar Morse. Vervolgens worden de -, . en x (pauze) omgezet naar letters. De letter wordt steeds random gekozen uit een verzameling. De sleutels mogen geen overeenkomende letters hebben.",
      "k1": "Tekens voor .",
      "k2": "Tekens voor -",
      "k3": "Tekens voor x"
    },
    "porta": {
      "info": "De Porta cijfer gebruikt 13 verschillende alfabetten die een variant zijn op het standaard tableau van de Vigenerecijfer (die gebruikt 26 alfabetten). De sleutel bepaalt de volgorde waarin de alfabetten worden gekozen.",
      "k1": "Sleutel (verplicht)"
    },
    "portax": {
      "info": "De Portax cijfer combineert verschillende technieken. Hij is vervangt digrams (2 letters), gebruikt meerdere alfabetten (het alfabet wordt steeds verschoven) en tenslotte ook transpositie (rij naar kolommen).",
      "k1": "Transpositiesleutel"
    },
    "ragbaby": {
      "info": "Ragbaby is een substitutiecijfer. De sleutel wordt gebruikt om het cijferalfabet te genereren. De substitutie wordt steeds berekend op basis van woordpositie en letterpositie in het woord (bijv. 1e woord, 1e letter = 1 en 3e woord, 4e letter = 6). Oorspronkelijk wordt een 24-letter alfabet gebruikt met I=J en W=X, maar dat is niet noodzakelijk.",
      "k1": "Sleutel"
    },
    "railfence": {
      "info": "De Railfence cijfer is een transpositie cijfer die gebruikmaakt van een zigzag-patroon (rails). De offset wordt gebruikt om niet op de eerste rails naar beneden te beginnen, maar bijvoorbeeld op de derde rails naar boven.",
      "k1": "Aantal rails (groter dan 1)",
      "k2": "Offset"
    },
    "redefence": {
      "info": "De Redefence cijfer is een transpositie cijfer die gebruikmaakt van een zigzagpatroon (rails). Hij is identiek aan de Railfence cijfer, alleen kan de volgorde waarin de rails worden afgedrukt worden aangepast.",
      "k1": "Aantal rails (groter dan 1)",
      "k2": "Offset",
      "k3": "Volgorde van de rails"
    },
    "reverse": {
      "info": "Omkeren van het bericht."
    },
    "reversewords": {
      "info": "Omkeren van elk woord in het bericht."
    },
    "rot5": {
      "info": "ROT5 is een simpele Caesar cijfer die bedoeld is voor getallen. De standaard shift is 5.",
      "k1": "Verschuiving"
    },
    "rot47": {
      "info": "ROT47 is een Caesar cijfer die de ASCII karakters 33 t/m 126 gebruikt (hoofdletters, kleine letters, cijfers en diverse leestekens en symbolen). De standaardverschuiving is 47.",
      "k1": "Verschuiving"
    },
    "rot123": {
      "info": "Bij ROT123 wordt de verschuiving steeds 1 positie verhoogd. Cijfers worden apart verschoven. Andere tekens worden niet gecodeerd."
    },
    "scytale": {
      "info": "Scytale is een simpele transpositiecijfer die al gebruikt werd in het oude Griekenland. Het bericht wordt geschreven op een lint dat om een rol wordt gewikkeld. Vervolgens wordt het regel voor regel afgelezen.",
      "k1": "Aantal wikkelingen"
    },
    "skip": {
      "info": "Een simpele transpositiecijfer. Sla steeds hetzelfde aantal letters over.",
      "k1": "Skipwaarde",
      "k2": "Beginpositie"
    },
    "substitution": {
      "info": "Dit is de algemene substitutiecijfer. Elke letter wordt vervangen door de letter in het sleutelalfabet op dezelfde positie. Als je de sleutel niet kent is deze cijfer beter op te lossen met de Slimme Substitutie tool (zie Teksttools).",
      "k1": "Cijferalfabet"
    },
    "syllabary": {
      "info": "De Syllabary cijfer is geintroduceerd door G-MAN (Robert J Friedman) in 2012 in Cryptogram Magazine. De cijfer is gebaseerd op een 10 x 10 tabel met daarin alle 26 letters, de 10 cijfers en een groot aantal digrammen en trigrammen. Het is vaak mogelijk woorden op meerdere manieren te coderen door. Zo kan AMSTERDAM gecodeerd worden als A M ST ER DA M maar ook als A M S TER D A M. Dit algoritme zoekt eerst de trigrammen, daarna de digrammen en tenslotte losse letters. Bij het decoderen maakt dit niet uit. Elk correct gecodeerd bericht kan worden vertaald. De rijen en kolommen hebben standaard de nummers 0123456789 maar dit kan worden aangepast.",
      "k1": "Sleutel voor tabel",
      "k2": "Linker (rij) labels",
      "k3": "Top (kolom) labels"
    },
    "tapir": {
      "info": "TAPIR is de naam van een substitutietabel die gebruikt werd door het Volksleger en het Ministerie van Staatsveiligheid in de DDR. Het substitueert letters, enkele digrammen, cijfers en enkele speciale tekens."
    },
    "trevanion": {
      "info": "Trevanion neemt elke letter na een leesteken. Standaard is dit de eerste, maar elke aantal is mogelijk. Behalve leestekens kunnen ook andere tekens als signaal gebruikt worden, bijvoorbeeld cijfers. De code is genoemd naar John Trevanion, een Engelse gevangene die volgens het verhaal een brief ontving van een vriend met deze codering. Het verhaal is vermoedelijk verzonnen.",
      "k1": "Leestekens",
      "k2": "Offset"
    },
    "trifid": {
      "info": "De Trifid cijfer gebruikt 3 vierkanten van 3x3 op basis van een alfabet van 27 letters. De sleutel wordt gebruikt om de vierkanten te genereren. Elke letter wordt gecodeerd op basis van vierkant, rij, kolom (3 cijfers). Die worden per kolom achter elkaar gezet en daarna per rij opgeschreven. Hierdoor onstaat fractionering.",
      "k1": "Sleutel"
    },
    "trisquare": {
      "info": "De Trisquare cijfer gebruikt drie Polybiusvierkanten. Groepen van twee letters (digrams) worden vertaald naar groepjes van 3 letters.",
      "k1": "Vierkant 1",
      "k2": "Vierkant 2",
      "k3": "Vierkant 3"
    },
    "vatsyayana": {
      "info": "De Vatsyayana or Kamasutra cijfer is een simpele substitutiecijfer die paren van letters gebruikt (meestal 13), waarbij de letters steeds elkaars vervanging zijn.",
      "k1": "Eerste helft van de paren",
      "k2": "Tweede helft van de paren"
    },
    "vigenere": {
      "info": "De Vigenère cijfer is een klassieke polyalfabetische cijfer. Er worden 26 verschillende alfabetten gegenereerd, waarbij elk alfabet steeds een positie wordt verschoven. Het zo ontstane tableau heet ook wel tableau recta. De sleutel bepaald in welke volgorde de verschillende alfabetten worden gebruikt.",
      "k1": "Sleutel (verplicht)"
    },
    "zebra": {
      "info": "ZEBRA is de naam van een substitutietabel die gebruikt werd door het Volksleger en het Ministerie van Staatsveiligheid in de DDR. Het substitueert letters, inclusief Ä, Ü en Ö, enkele digrammen, enkele trigrammen, cijfers en enkele speciale tekens."
    },
    "zygazyfa": {
      "info": "De Zygazyfa cijfer is bedacht door Ray Crowther die hem gebruikt in sommige van zijn geocaches. Het is een polyalfabetische cijfer, waarbij het volgende alfabet steeds wordt gegenereerd op basis van de te coderen letter.",
      "k1": "Sleutel"
    }
  },

  "cperrors" : {
    "nothingtodo": "Geen bericht om te coderen of te decoderen.",
    "isrequired" : " is verplicht.",
    "mustbegreaterthen1" : " moet groter dan 1 zijn.",
    "mustbegreaterthen0" : " moet groter dan 0 zijn.",
    "mustbe1or2": " moet 1 of 2 zijn.",
    "mustbe1char": " moet precies 1 teken zijn.",
    "mustbeeof": " moet een teken zijn dat niet in het alfabet voorkomt.",
    "mustbenumeric": " moet een getal zijn.",
    "mustbehalfalf" : " moet de halve lengte van het alfabet zijn.",
    "msg25key": "Bericht moet 25 keer de lengte van de sleutel lang zijn.",
    "mustbe10ormore" : " moet 10 of meer tekens lang zijn.",
    "mustbe9": " moet precies 9 tekens lang zijn.",
    "msgmustbesquareofkey" : "Bericht moet het kwadraat van de lengte van de sleutel lang zijn.",
    "keylongerthenmsg" : " moet net zo lang of langer zijn dan de lengte van het bericht.",
    "keymustbesqrroot" : " sleutel moet de wortel van de lengte van het alfabet lang zijn.",
    "keymustbealph" : " moet dezelfde lengte hebben als het alfabet.",
    "keyfromalph" : " moet zijn samengesteld uit het alfabet.",
    "keymustbenumeric" : " moet numeriek zijn."
  },

  "codebook": {
    "title": "Codebook",
    "long": "Vind de juiste code door te zoeken op tags en woorden. Bijna 200 verschillende codes. Beschikbare tags referen naar de oorsprong van de code, de vorm of andere manieren om de code te identificeren. Tags en uitleg bij het codebook vooralsnog alleen in het Engels beschikbaar.",
    "availtags": "Beschikbare tags",
    "pagesfound": "codes gevonden"
  },
  
  "fonts": {
    "title": "Speciale fonts",
    "long": "<p>Een code is soms niet veel meer dan het gebruik van een ander font, bijvoorbeeld Webdings. Ook zijn veel codes uit bijvoorbeeld games en televisieseries beschikbaar als font. Type een tekst en zie het resultaat in het geselecteerde font. Maak een schermafbeelding voor je eigen puzzel of gebruik de tool om puzzels op te lossen.</p>",
    "selfont": "Selecteer font",
    "fontsize": "Selecteer grootte",
    "selcolor": "Selecteer kleur",
    "lineheight": "Regelafstand",
    "standard": "Standaard"
  },
  
  "segment": {
    "title": "Segment display",
    "long": "<p>Segment displays worden gebruikt in electronica. Nummers en letters worden getoond door 7, 14 of 16 segmenten aan of uit te schakelen. De segmenten worden aangeduid met letters, bijvoorbeeld A t/m G voor een 7-segment display. Ook kunnen 0 en 1 worden gebruikt om aan te geven welk segment uit en aan is.</p><p>Kies het aantal segmenten: 7, 14 of 16. Kies de notatie van segmenten: letters of binair. Klik op Codeer om de invoer te vertalen naar segmenten, klik op Decodeer om segmentnotatie te vertalen naar tekst.</p>",
    "segsize": "Aantal segmenten",
    "input": "Segmenten notatie letters of binair",
    "letters": "Letternotatie",
    "binary": "Binaire notatie"
  },

  "exifscanner": {
    "title": "Exif Scanner",
    "long": "Exif Reader haalt de metadata (EXIF en andere informatie) van een foto op. Indien een GPS locatie aanwezig is wordt die getoond op de kaart.",
    "nogps": "Geen GPS van de camera",
    "gps": "GPS van de camera",
    "error": "Fout bij het laden van de foto of het ophalen van de EXIF data",
    "noinfo": "Geen info",
    "info": "Image info",
    "cinfo": "Camera info",
    "desc": "Omschrijving",
    "ainfo": "Informatie auteur",
    "filename": "Filenaam",
    "filetype": "Type",
    "size": "Grootte",
    "width": "Breedte",
    "height": "Hoogte",
    "npixels": "# pixels",
    "date": "Datum & tijd",
    "datec": "Aanmaakdatum & tijd",
    "camera": "Camera",
    "lens": "Lens",
    "aperture": "Diafragma",
    "shutter": "Sluiter",
    "title2": "Titel",
    "subject": "Onderwerp",
    "about": "Info",
    "keywords": "Keywords",
    "comment": "Commentaar",
    "artist": "Artiest",
    "creator": "Maker",
    "author": "Auteur",
    "copyright": "Copyright"
  },

  "colorpicker": {
    "title": "Kleurenkiezer",
    "long": "Kleurenkiezer. Laad een afbeelding en selecteer een kleur. De tool toont de RGB, hex, CMY(K), HSL en HSV waardes van de geselecteerde kleur.",
    "selcolor": "Geselecteerde kleur",
    "rgbval": "RGB waardes",
    "alpha": "Alpha",
    "hexval": "RGB hexadecimaal",
    "hex": "RGB hex",
    "hslval": "HSL (Tint, Verzadiging, Lichtheid)",
    "hue": "Tint",
    "sat": "Verzadiging",
    "lum": "Lichtheid",
    "hsvval": "HSV/HSB (Tint, Verzadiging, Helderheid)",
    "bri": "Helderheid",
    "cmykval": "CMYK waardes",
    "cmyval": "CMY waardes"
  },

  "filltool": {
    "title": "Kleuren aanpassen",
    "long": "<p>Vervang een kleur door een andere kleur. Probeer grote vlakken van eenzelfde kleur te vervangen door een andere kleur om onzichtbare verschillen in kleur tevoorschijn te halen. Converteer de afbeelding naar zwart wit, sepia of probeer een van de andere filters. Pas de helderheid of het contrast, of verminder de kleurdiepte. Spiegel de afbeelding.</p><p>Klik op een willekeurige plek in de afbeelding om die kleur te vullen. De vulkleur kan worden ingesteld. De tolerantie is standaard 0. Door de tolerantie aan te passen worden kleuren die lijken op de gekozen kleur ook vervangen. De maximum tolerantie is 255, in dat geval wordt de hele afbeelding gevuld. Gebruik de knop Origineel om de originele afbeelding weer te tonen.</p>",
    "selfill": "Vulkleur",
    "tol": "Tolerantie",
    "fill": "Vul kleur",
    "fillinfo": "Klik in de afbeelding om een gebied te vullen.",
    "filter": "Filter",
    "conbri": "Helderheid & contrast",
    "brigh": "Helderheid",
    "contr": "Contrast",
    "gray1": "Zwart/Wit (Gemiddelden)",
    "gray2": "Zwart/Wit (Luminanctie)",
    "invert": "Negatief",
    "sepia": "Sepia",
    "colordepth": "Kleurdiepte aanpassen",
    "colors": "kleuren"
  },

  "pixeldata": {
    "title": "Pixel data",
    "long": "<p>Tool om het totaal van rood, groen en blauw waardes te berekenen. Tool om het aantal pixels met een bepaalde kleur (RGB waarde) te tellen. De hoogte, breedte en het totaal aantal pixels worden ook getoond.</p><p>De tool werkt perfect met PNG, maar lijkt met JPG een afwijking te hebben.</p>",
    "count": "Selecteer rood, groen en blauw om het aantal pixels met deze kleur te tellen."
  },

  "pixelbuild": {
    "title": "Pixelbeeld",
    "long": "<p>Pixlebeed is een tool om een afbeelding op te bouwen aan de hand van een tekst met maximaal 10 verschillende karakters. Elk karakter staat voor één bepaalde kleur. Een voorbeeld is een bestand met 0 en 1 wat een QR code voorstelt. Een ander voorbeeld is kleurplaat.</p><p>Hoogte en breedte zijn optioneel. Als de hoogte leeg is wordt het aantal regels van de tekst gebruikt. Als de breedte leeg is wordt de lengte van de eerste regel gebruikt. Het is mogelijk om voor elk karakter de te gebruiken kleur in te stellen.</p>",
    "input": "Tekstinvoer",
    "options": "Instellingen"
  },

  "imagetransform": {
    "title": "Transformeren",
    "long": "Spiegel horizontaal en/of verticaal (geheel of gedeeltelijk), verschuif rijen en/of kolommen een aantal pixels.",
    "shift": "Verschuif",
    "shiftinfo": "Selecteer het aantal pixels om rijen/kolommen te verschuifen",
    "shiftr": "Verschuif rij #pixels",
    "shiftc": "Verschuif kolom #pixels",
    "fliphalf": "Spiegel de halve afbeelding",
    "flipinfo": "Selecteer de breedte van een rij of kolom.",
    "flipr": "Rijen van #pixels",
    "flipc": "Kolommen van #pixels",
    "transform": "Spiegelen",
    "fliph": "Spiegel horizontaal",
    "flipv": "Spiegel verticaal"
  },

  "textextractor": {
    "title": "Tekst in file",
    "long": "De tool zoekt mogelijke teksten door te zoeken naar aaneengesloten afdrukbare karakters (ASCII 32 t/m 126). De minimale hoeveelheid aaneengesloten tekens kan worden ingesteld. Het maximale aantal zoekresultaten en de startpositie om te beginnen met zoeken zijn ook instelbaar. Door bijvoorbeeld eerst te zoeken op langere teksten kan vervolgens met de startpositie worden ingezoomd op een bepaald gebied met mogelijke kortere teksten. Grote files scannen kan enige tijd duren of deze kunnen in het geheel niet worden geladen.",
    "length": "Minimale lengte",
    "max": "Maximaal aantal resultaten",
    "start": "Start op positie",
    "maxexceeded": "Maximaal aantal zoekresultaten bereikt. Om verder te zoeken gebruik startpositie.",
    "fileerror": "Fout tijdens het laden van de file"
  },

  "htmlparser": {
    "title": "Scan HTML",
    "long": "Soms wordt informatie verstop in de listing van de geocache met gebruik van HTML. Bijvoorbeeld door commentaar toe te voegen, witte tekst te gebruiken of heel erg kleine letters. Of er worden letters gemarkeerd door ze vet of schuin te maken of op een andere manier te onderscheiden. HTML Scanner scant de paginabron op links, afbeeldingen en andere verborgen informatie. De tool werkt alleen met de officiële listing van geocaching.com. Kopieer en plak de paginabron hieronder.",
    "ph": "Plak de paginabron hier",
    "btnscan": "Scan",
    "links": "Links - selecteer om de link te openen",
    "images": "Afbeeldingen - selecteer om de afbeelding te bekijken",
    "bgimages": "Achtergronden - selecteer om de afbeelding te bekijken",
    "comms": "(Verborgen) commentaren gevonden",
    "white": "Witte tekst gevonden",
    "strong": "Belangrijke tekst",
    "bold": "Vette tekst",
    "ital": "Cursieve tekst",
    "sup": "Superscript tekst",
    "sub": "Subscript tekst",
    "size": "Afwijkende lettergrootte",
    "del": "Verwijderde tekst",
    "em": "Benadrukte tekst",
    "nocache": "Geen cache details gevonden. Laad een correcte paginabron.",
    "complete": "Scan compleet, details hieronder (kan eventueel leeg zijn).",
    "error": "Fout bij het laden of scannen van de paginabron."
  },

  "sudokusolv": {
    "title": "Sudoku oplosser",
    "long": "Sudoku en Sudoku X oplosser, afmetingen 2x2 en 3x3. 4x4 uitgeschakeld vanwege belasting server. Vul het vierkant of voer de hints in als rij, kolom, cijfer gescheiden door komma's, bijv. 125,243,254",
    "error": "Fout bij het oplossen van de sudoky. Te veel oplossing of timeout van de server",
    "type": "Sudoku type",
    "size": "Afmeting",
    "alt": "Hints",
    "solve": "Los op",
    "thereare": "Er zijn",
    "sols": "oplossingen"
  },

  "mmsolver": {
    "title": "Mastermind oplosser",
    "long": "<p>Mastermind is een logische puzzel. Het doel is een code (set kleuren) te achterhalen. Voor elke poging wordt het aantal correcte pins (kleur en positie) alsmede het aantal pins waarvan alleen de kleur juist is (maar de positie niet) gegeven. Door deze informatie logisch te gebruiken kan in een aantal pogingen de juiste combinatie worden gevonden. Het originele spel was 5 posities en 8 kleuren. De meeste populaire variant heeft 4 posities en 6 kleuren. De kleuren kunnen uniek zijn maar dat is meestal niet het geval. Deze tool gebruikt cijfers in plaats van kleuren. Voer het aantal pins, het aantal kleuren en de gedane pogingen in en de tool berekent de mogelijke combinaties.</p>",
    "npin": "Aantal pins",
    "ncolor": "Aantal kleuren",
    "unique": "Kleuren zijn uniek",
    "pins": "Pogingen",
    "pos": "Kleur & positie",
    "col": "Alleen kleur",
    "invalidhint1": "Poging heeft onjuist aantal pins",
    "invalidhint2": "Poging heeft een ongeldige kleur",
    "invalidhint3": "Aantal matches moet kleiner of gelijk zijn aan het aantal pins"
  },

  "periodictable": {
    "title": "Periodiek systeem",
    "long": "<p>Het periodiek systeem is een classificatie van chemische elementen. Chemische elementen hebben een nummer en een één- of tweeletterig symbool. Daarnaast worden de elementen ingedeeld in een bepaalde groep, een bepaalde periode en een bepaald blok. Elementen hebben daarnaast nog veel meer eigenschappen zoals massa, smeltpunt, aantal electronen, enzovoorts. Wanneer de hier getoonde eigenschappen geen resultaat opleveren, kan het lonen te kijken naar de overige eigenschappen.  Elementen 119 en hoger hebben nog geen officiële naam, maar alleen een systematische naam. De elementen 110, 111 en 112 stonden tot 2004 bekend als Uun, Uuu en Uub.</p><p>De tool zoekt op basis van nummer, naam of symbool. Foutieve invoer wordt genegeerd. Nummers en namen moeten gescheiden worden door spaties. Symbolen mogen aan elkaar geschreven worden en gebruiken de officiële notatie van een hoofdletter, eventueel gevolgd door een kleine letter, bijvoorbeeld HSAgCoCCr. Let op dat betekend bijvoorbeeld dat Co staat voor Cobalt, maar CO staat voor Koolstof en Zuurstof (Carbon en Oxygen). De tool gebruikt de Engelse namen voor de elementen.</p>",
    "ph": "Type nummers, namen of symbolen",
    "searchsym": "Zoek symbolen",
    "searchnum": "Zoek nummers",
    "searchname": "Zoek namen",
    "num": "Nummer",
    "sym": "Symbool",
    "grp": "Groep",
    "prd": "Periode",
    "blk": "Blok",
    "name": "Naam"
  },

  "resistor": {
    "title": "Weerstandscode",
    "long": "<p>Weerstanen gebruiken gekleurde banden om de waarde (in Ohm) te specificeren. Kleuren zijn makkelijker te lezen dan nummers. Er zijn versies met 3, 4, 5 en 6 banden. Voor de versies met 3 en 4 banden zijn de eerste twee banden de waarde en de 3e band is de vermenigvuldigingsfactor (het aantal nullen). Voor de versies met 5 of 6 banden zijn de eerste drie banden de waarde en is de 4e band de vermenigvuldigingsfactor (het aantal nullen). (De 5e band is de tolerantie en de 6e de thermische capaciteit). De kleurcodes zijn:&nbsp;<span style='text-align: center'><span style='background-color: black; color: white; padding-right: 15px; padding-left: 15px;'>0</span><span style='background-color: brown; color: white; padding-right: 15px; padding-left: 15px;'>1</span><span style='background-color: red; color: black; padding-right: 15px; padding-left: 15px;'> 2 </span><span style='background-color: orange; color: black; padding-right: 15px; padding-left: 15px;'> 3 </span><span style='background-color: yellow; color: black; padding-right: 15px; padding-left: 15px;'> 4 </span><span style='background-color: green; color: black; padding-right: 15px; padding-left: 15px;'> 5 </span><span style='background-color: blue; color: white; padding-right: 15px; padding-left: 15px;'> 6 </span><span style='background-color: violet; color: black; padding-right: 15px; padding-left: 15px;'> 7 </span><span style='background-color: gray; color: black; padding-right: 15px; padding-left: 15px;'> 8 </span><span style='background-color: white; color: black; padding-right: 15px; padding-left: 15px;'> 9 </span></span><br><p>De kleuren goud en silver zijn alleen geldig voor de vermenigvuldiging, goud is x 0.1 en zilver is x 0.01. De tool werkt voor de versies met 5 en 6 banden, selecteer de kleuren van de eerste 4 banden. De tool werkt eventueel ook voor de versie met 3 of 4 banden. Selecteer voor de 1e band zwart (0) en selecteer daarna band 2, band 3 en de vermenigvuldigsfactor.</p>",
    "band": "Band",
    "mult": "x Factor",
    "res": "De weerstand bedraagt:"
  },

  "decabit": {
    "title": "Decabit",
    "long": "<p>Decabit is een protocol om data over het electriciteitsnet te transporteren door middel van een serie pulsen. Nummers tussen 0 en 126 worden door steeds 5 plus en 5 mintekens gecodeerd. De nummers kunnen geïnterpreteerd worden als nummers, als ASCII of iets anders, zoals de posities in het alfabet</p><p>Deze tool codeert en decodeert decabit. Invoer/uitvoer kan nummers of tekst zijn. Nummers moeten tussen de 0 en 126 zijn. Druk op Coderen om te vertalen naar decabit, druk op decoderen om decabit te vertalen naar tekst of nummers.</p>",
    "selenc": "Selecteer codering",
    "selnum": "Nummers (0 - 126)",
    "selascii": "Tekst ASCII",
    "selalpha": "Tekst alfabet (A=1, Z=26)"
  },

  "countries": {
    "title": "Landen van de wereld",
    "long": "<p>Tabel met alle landen en autonome gebieden in de wereld conform ISO3166. In totaal 249 landen met naam, munteenheid en vlag, ISO 2- en 3 letter codes en ISO land nummer, internationaal nummer voor telefonie en registratiecode voor voertuigen (kenteken). De namen zijn de gangbare namen en niet de officiële; toevoegingen als 'Republiek' ontbreken meestal. De munteenheden zijn de versimpele naam, landaanduidingen zoals 'Australische' ontbreken. De codes voor de munteenheden zijn de meest recente, maar let op dat deze codes soms kunnen wijzigen.</p><p>De codes en nummers, of de woordwaarde of stapeltelling hiervan, worden vaak gebruikt in geocaches.</p><p>Zoeken kan op meerdere codes, namen, nummers tegelijk. Voor de 2-letter, 3-letter codes is een spatie ertussen niet nodig.</p>",
    "ph": "Voer meerdere codes, nummers of namen in",
    "flag": "Vlag",
    "ccode3": "ISO 3-letter code",
    "ccode2": "ISO 2-letter code",
    "cnum": "ISO land nr",
    "name": "Land",
    "tel": "Telefoon",
    "web": "Web TLD",
    "cur": "Munt",
    "ccur": "Munt code",
    "lcp": "Kenteken",
    "names": {
      "abw": "Aruba",
      "afg": "Afghanistan",
      "ago": "Angola",
      "aia": "Anguilla",
      "ala": "Åland",
      "alb": "Albanië",
      "and": "Andorra",
      "are": "Verenigde Arabische Emiraten",
      "arg": "Argentinië",
      "arm": "Armenië",
      "asm": "Amerikaans-Samoa",
      "ata": "Antarctica",
      "atf": "Franse Zuidelijke en Antarctische Gebieden",
      "atg": "Antigua en Barbuda",
      "aus": "Australië",
      "aut": "Oostenrijk",
      "aze": "Azerbeidzjan",
      "bdi": "Burundi",
      "bel": "België",
      "ben": "Benin",
      "bes": "Caribisch Nederland",
      "bfa": "Burkina Faso",
      "bgd": "Bangladesh",
      "bgr": "Bulgarije",
      "bhr": "Bahrein",
      "bhs": "Bahama's",
      "bih": "Bosnië en Herzegovina",
      "blm": "Saint-Barthélemy",
      "blr": "Wit-Rusland",
      "blz": "Belize",
      "bmu": "Bermuda",
      "bol": "Bolivia",
      "bra": "Brazilië",
      "brb": "Barbados",
      "brn": "Brunei",
      "btn": "Bhutan",
      "bvt": "Bouveteiland",
      "bwa": "Botswana",
      "caf": "Centraal-Afrikaanse Republiek",
      "can": "Canada",
      "cck": "Cocoseilanden",
      "che": "Zwitserland",
      "chl": "Chili",
      "chn": "China",
      "civ": "Ivoorkust",
      "cmr": "Kameroen",
      "cod": "Congo-Kinshasa",
      "cog": "Congo-Brazzaville",
      "cok": "Cookeilanden",
      "col": "Colombia",
      "com": "Comoren",
      "cpv": "Kaapverdië",
      "cri": "Costa Rica",
      "cub": "Cuba",
      "cuw": "Curaçao",
      "cxr": "Christmaseiland",
      "cym": "Kaaimaneilanden",
      "cyp": "Cyprus",
      "cze": "Tsjechië",
      "deu": "Duitsland",
      "dji": "Djibouti",
      "dma": "Dominica",
      "dnk": "Denemarken",
      "dom": "Dominicaanse Republiek",
      "dza": "Algerije",
      "ecu": "Ecuador",
      "egy": "Egypte",
      "eri": "Eritrea",
      "esh": "Westelijke Sahara",
      "esp": "Spanje",
      "est": "Estland",
      "eth": "Ethiopië",
      "fin": "Finland",
      "fji": "Fiji",
      "flk": "Falklandeilandens",
      "fra": "Frankrijk",
      "fro": "Faeröer",
      "fsm": "Micronesia",
      "gab": "Gabon",
      "gbr": "Verenigd Koninkrijk",
      "geo": "Georgië",
      "ggy": "Guernsey",
      "gha": "Ghana",
      "gib": "Gibraltar",
      "gin": "Guinee",
      "glp": "Guadeloupe",
      "gmb": "Gambia",
      "gnb": "Guinee-Bissau",
      "gnq": "Equatoriaal-Guinea",
      "grc": "Griekenland",
      "grd": "Grenada",
      "grl": "Groenland",
      "gtm": "Guatemala",
      "guf": "Frans-Guyana",
      "gum": "Guam",
      "guy": "Guyana",
      "hkg": "Hongkong",
      "hmd": "Heard en McDonaldeilanden",
      "hnd": "Honduras",
      "hrv": "Kroatië",
      "hti": "Haïti",
      "hun": "Hongarije",
      "idn": "IndoIndonesiënesia",
      "imn": "Man",
      "ind": "India",
      "iot": "Brits Indische Oceaanterritorium",
      "irl": "Ierland",
      "irn": "Iran",
      "irq": "Irak",
      "isl": "IJsland",
      "isr": "Israël",
      "ita": "Italië",
      "jam": "Jamaica",
      "jey": "Jersey",
      "jor": "Jordanië",
      "jpn": "Japan",
      "kaz": "Kazachstan",
      "ken": "Kenia",
      "kgz": "Kirgizië",
      "khm": "Cambodja",
      "kir": "Kiribati",
      "kna": "Saint Kitts en Nevis",
      "kor": "Zuid-Korea",
      "kwt": "Koeweit",
      "lao": "Laos",
      "lbn": "Libanon",
      "lbr": "Liberia",
      "lby": "Libië",
      "lca": "Saint Lucia",
      "lie": "Liechtenstein",
      "lka": "Sri Lanka",
      "lso": "Lesotho",
      "ltu": "Litouwen",
      "lux": "Luxemburg",
      "lva": "Letland",
      "mac": "Macau",
      "maf": "Sint-Maarten",
      "mar": "Marokko",
      "mco": "Monaco",
      "mda": "Moldavië",
      "mdg": "Madagaskar",
      "mdv": "Maldiven",
      "mex": "Mexico",
      "mhl": "Marshalleilanden",
      "mkd": "Noord-Macedonië",
      "mli": "Mali",
      "mlt": "Malta",
      "mmr": "Myanmar",
      "mne": "Montenegro",
      "mng": "Mongolië",
      "mnp": "Noordelijke Marianen",
      "moz": "Mozambique",
      "mrt": "Mauritanië",
      "msr": "Montserrat",
      "mtq": "Martinique",
      "mus": "Mauritius",
      "mwi": "Malawi",
      "mys": "Maleisië",
      "myt": "Mayotte",
      "nam": "Namibië",
      "ncl": "Nieuw-Caledonië",
      "ner": "Niger",
      "nfk": "Norfolk",
      "nga": "Nigeria",
      "nic": "Nicaragua",
      "niu": "Niue",
      "nld": "Nederland",
      "nor": "Noorwegen",
      "npl": "Nepal",
      "nru": "Nauru",
      "nzl": "Nieuw-Zeeland",
      "omn": "Oman",
      "pak": "Pakistan",
      "pan": "Panama",
      "pcn": "Pitcairneilanden",
      "per": "Peru",
      "phl": "Filipijnen",
      "plw": "Palau",
      "png": "Papoea-Nieuw-Guinea",
      "pol": "Polen",
      "pri": "Puerto Rico",
      "prk": "Noord-Korea",
      "prt": "Portugal",
      "pry": "Paraguay",
      "pse": "Palestina",
      "pyf": "Frans-Polynesië",
      "qat": "Qatar",
      "reu": "Réunion",
      "rou": "Roemenië",
      "rus": "Rusland",
      "rwa": "Rwanda",
      "sau": "Saoedi-Arabië",
      "sdn": "Soedan",
      "sen": "Senegal",
      "sgp": "Singapore",
      "sgs": "Zuid-Georgia en de Zuidelijke Sandwicheilanden",
      "shn": "Sint-Helena, Ascension en Tristan da Cunha",
      "sjm": "Spitsbergen en Jan Mayen",
      "slb": "Salomonseilanden",
      "sle": "Sierra Leone",
      "slv": "El Salvador",
      "smr": "San Marino",
      "som": "Somalië",
      "spm": "Saint-Pierre en Miquelon",
      "srb": "Servië",
      "ssd": "Zuid-Soedan",
      "stp": "Sao Tomé en Principe",
      "sur": "Suriname",
      "svk": "Slowakije",
      "svn": "Slovenië",
      "swe": "Zweden",
      "swz": "Swaziland",
      "sxm": "Sint Maarten",
      "syc": "Seychellen",
      "syr": "Syrië",
      "tca": "Turks- en Caicoseilanden",
      "tcd": "Tsjaad",
      "tgo": "Togo",
      "tha": "Thailand",
      "tjk": "Tadzjikistan",
      "tkl": "Tokelau",
      "tkm": "Turkmenistan",
      "tls": "Oost-Timor",
      "ton": "Tonga",
      "tto": "Trinidad en Tobago",
      "tun": "Tunesië",
      "tur": "Turkije",
      "tuv": "Tuvalu",
      "twn": "Taiwan",
      "tza": "Tanzania",
      "uga": "Oeganda",
      "ukr": "Oekraïne",
      "umi": "Kleine afgelegen eilanden van de Verenigde Staten",
      "ury": "Uruguay",
      "usa": "Verenigde Staten",
      "uzb": "Oezbekistan",
      "vat": "Vaticaanstad",
      "vct": "Saint Vincent en de Grenadines",
      "ven": "Venezuela",
      "vgb": "Britse Maagdeneilanden",
      "vir": "Amerikaanse Maagdeneilanden",
      "vnm": "Vietnam",
      "vut": "Vanuatu",
      "wlf": "Wallis en Futuna",
      "wsm": "Samoa",
      "yem": "Jemen",
      "zaf": "Zuid-Afrika",
      "zmb": "Zambia",
      "zwe": "Zimbabwe"
    }
  },

  "usastates": {
    "title": "Staten van de VS",
    "long": "<p> Lijst van staten van de VS inclusief vlag, hoofdstad, aantal zetels in het Huis van Afgevaardigden, ranking op oppervlakte en ranking op toetredingsdatum. De code is zowel de code gebruikt door de US Post als de code volgens <a href='https://en.wikipedia.org/wiki/ISO_3166-2:US'>ISO3166-2:US</a>. De naam van de staat is een link naar de Wikipedia.</p><p>Het is mogelijk meerdere codes, namen en nummers in te voeren gescheiden door spaties. Voor de USPS Code kan de spatie achterwege blijven.</p>",
    "ph": "Voer zoektermen in gescheiden door spaties, voor ISO3166 codes kan de spatie achterwege blijven",
    "flag": "Vlag",
    "code": "ISO3166:2 code",
    "name": "Staat",
    "num": "Toetreding",
    "reps": "Huis reps",
    "area": "Opp. ranking",
    "cap": "Hoofdstad"
  },

  "regions": {
    "title": "Provincies",
    "long": "<p>Provincies van Nederland, België, Duitsland en Frankrijk met ISO code, naam, hoofdstad en diverse andere gegevens, inclusief vlag. De code is de code volgens <a href='https://nl.wikipedia.org/wiki/ISO_3166-2:NL'>ISO3166-2:NL</a>. De naam van de provincie is een link naar de Wikipedia pagina in de taal van het betreffende land (Nederlands, Duits of Frans).</p>",
    "ph": "Voer zoektermen in gescheiden door spaties, voor ISO3166 codes kan de spatie achterwege blijven",
    "list": "Landen",
    "nl": "Nederland",
    "be": "België",
    "de": "Duitsland",
    "fr": "Frankrijk",
    "flag": "Vlag",
    "code": "ISO3166:2 code",
    "name": "Provincie",
    "mun": "#Gemeentes",
    "area": "Opp. ranking",
    "cap": "Hoofdstad",
    "cat": "Type regio",
    "dep": "#Departmenten",
    "arr": "#Arrondisementem",
    "canton": "#Cantons",
    "bundesrat": "Bundesrat reps",
    "landkreise": "#Landkreise",
    "stadtkreise": "#Kreisefreie stadt"
  },

  "unitconvertor" : {
    "title": "Eenheden",
    "long": "Deze tool converteert een groot aantal eenheden. Eenheden zijn onderverdeeld in categoriën, zoals lengte of temperatuur. De standaard tegenwoordig gebruikt het metrieke stelsel (zoals meter, kilogram). In Engels sprekende landen wordt het imperial systeem nog veel gebruikt (zoals inch, acre or ounce). Voor introductie van deze standaarden waren er veel andere systemen in gebruik die verschilden van regio tot regio. Alle standaard eenheden evenals sommige van deze historische eenheden worden ondersteund.",
    "value": "Waarde",
    "selcat": "Selecteer een categorie",
    "unitfrom": "Van eenheid",
    "unitto": "Naar eenheid",
    "cat" : {
      "length": {
        "name": "Lengte & afstand",
        "desc": "De standaard eenheid is meter (m). Alle bekende voorvoegels kilo (1000), hecta (100), deca (10), deci (1/10), centi (1/100) en milli (1/1000) zijn ook beschikbaar. Engels sprekende landen gebruiken imperial eenheden met als basis de yard (yd) en afgeleide eenheden zoals de inch, voet en mijl. Verder zijn er een groot aantal oude Engelse, Franse en Russische eenheden beschikbaar."
      },
      "temp": {
        "name": "Temperatuur",
        "desc": "De standaard eenheid (SI unit) van temperatuur is Kelvin (K), het absolute nulpunt. Celsius en Fahrenheit worden echter het meest gebruikt. Verder zijn er enkele nu niet meer gebruikte temperatuurschalen beschikbaar."
      },
      "area": {
        "name": "Oppervlakte",
        "desc": "De standaard eenheid van oppervlakte is de vierkante meter (m2). Een are is 10mx10m, een hectare 100mx100m. Engels sprekende landen gebruiken de square yard (yd2) als basis."
      },
      "vol": {
        "name": "Volume",
        "desc": "De standaard eenheid van volume is de kubieke meter (m3). De liter (l of dm3) wordt ook veel gebruikt. Het Engelse / Amerikaanse systeem is gebaseerd op de gallon (gal), maar gebruiken beiden een andere gallon. Het Engelse systeem heeft bovendien een gallon van voor 1824 en na 1824. Het Amerikaanse systeem voor voeding heeft ook weer afwijkende maten. Oorspronkelijk werden verschillende eenheden gebruikt voor droge en vloeibare volumes. Dit is met uitzondering van de US niet meer gebruikelijk. Verder zijn er traditionele volumes van bier- en wijnvaten beschikbaar."
      },
      "power": {
        "name": "Vermogen",
        "desc": "De standaard van vermogen is de Watt (W)."
      },
      "mass": {
        "name": "Massa & gewicht",
        "desc": "De standaard eenheid is de kilogram (kg). Het Engels / Amerikaanse systeem gebruik de pound (lb) als basis. Voor edelstenen en edelmetalen is de troy pound nog steeds de standaard. De Engelse apothecaire eenheden zijn grotendeels vervangen door het metrieke systeem. Verder zijn er oude Russische eenheden (van voor de introductie van het metrieke systeem in 1925) en historische Romeinse eenheden beschikbaar."
      },
      "angle": {
        "name": "Hoek",
        "desc": "De standaard eenheid voor hoek is radians (rad), maar graden zijn meer gebruikelijk."
      },
      "speed": {
        "name": "Snelheid",
        "desc": "De standaard eenheid van snelheid is meter per second (m/s). Het Engelse stelsel gebruikt yard per seconde (yd/s) als basis. De knoop (knot) is een maritieme eenheid."
      },
      "time": {
        "name": "Tijd",
        "desc": "De standaard eenheid voor tijd is de seconde (s). De meeste andere eenheden zijn ook veel in gebruik. Voor de lengte van een jaar zijn verschillende definities in omloop. De Hebreeuwse kalender heeft zijn eigen eenheden voor tijd."
      }

    }
  },

  "dnacode": {
    "title": "DNA Code",
    "long": "<p>DNA of RNA codons worden weergegeven door 3 letters. Als je een code ziet met veel A, C, G, T of U is dat waarschijnlijk DNA of RNA. Soms worden er ook andere letters gebruikt. Die zijn staan voor een combinatie. Bijvoorbeeld Y betekent T of C, dus TAY betekent TAT of TAC. Type de codons and druk op Zoek.</p><p>Achtergrondinformatie. Codons zijn een combinatie van steeds drie nucleobasen. DNA is samengesteld uit A (Adenine), C (Cytosine)and G (Guanine) en T (Thymine). RNA deelt drie van de vier, maar T is vervangen door U (Uracil). De meeste codons definieren een aminozuur. Aminozuren hebben een naam, een drie letter afkorting of een één-letterige code. Enkele codons werken als start en stop signaal. Een stuk RNA of DNA bevat een reeks codons, elke codon triggert een specifiek aminozuur. De opgebouwde keten vormt een eiwit. Voor meer informatie lees <a href='https://en.wikipedia.org/wiki/DNA_and_RNA_codon_tables'>hier</a>.</p>",
    "ph": "Type zoektermen, bijvoorbeeld 3-letter RNA codons",
    "letter": "Letter",
    "abbr": "Afk.",
    "aminoacid": "Aminozuur",
    "rna": "RNA codons",
    "dna": "DNA codons"
  },

  "dialogpb":{
    "title": "Polybiusvierkant",
    "start": "Startalfabet:",
    "key": "Sleutel",
    "dir": "Richting",
    "corner": "Startlocatie",
    "flip": "Flip rij/kolom",
    "d": {
      "hor": "Horizontaal",
      "ver": "Verticaal",
      "diah": "Diagonaal links rechts",
      "diav": "Diagonaal boven onder",
      "si": "Spiraal binnenwaarts"
    },
    "c": {
      "tl": "Linksboven",
      "tr": "Rechtsboven",
      "bl": "Linksonder",
      "br": "Rechtsonder"
    }
  },

  "dialogmap": {
    "getloc": "Huidige locatie",
    "mapstyle": "Kaartsoort",
    "street": "Straten",
    "satellite": "Satelliet",
    "satstreet": "Satelliet/Straten",
    "outdoors": "Wandelen/Outdoor",
    "light": "Licht",
    "dark": "Donker",
    "hikebike": "Hike & bike",
    "transport": "Openbaar vervoer",
    "cyclemap": "Fietskaart",
    "landscape": "Landschap",
    "outdoors2": "Wandelroutes"
  },

  "convert": {
    "title": "Converteren",
    "long" : "Er zijn veel verschillende coördinaten in gebruik. De meest gangbare is WGS84, die standaard vrijwel overal gebruikt wordt, zoals bij geoaching.com en in navigatiesystemen. De Universale Transversale Mercator (UTM) is eveneens vrij gebruikelijk. Dan zijn er nog grid gebaseerde systemen, die x en y coördinaten gebruiken, zoals het Nederlandse Rijksdriehoekstelsel (RD), de Britse OGSM of de Belgisch Lambert. Maidenhead, geohash en Google's Open Location Code zijn normale coördinaten die gecodeerd worden als een hash. Mapcode en what3words zijn commerciële oplossingen om coördinaten te vereenvoudigen. Andere ondersteunde formaten zijn MGRS, OGSM en NAD. Je kan ook een willekeurige conversie invoeren middels de proj4 definitie van EPSG (als je weet hoe dat werkt).",
    "proj4jsmsg": "Je kan elk coördinaat systeem converteren door hieronder de proj4js definitie in te voeren. De definitie kan gevonden worden op <a href='http://epsg.io'>EPSG.io</a>. Neem de Proj4js.def (onderaan op de pagina) en kopieer de string die begint met + (zonder de aanhalingstekens).",
    "proj4jslabel": "Proj4js definitie",
    "phfrom": "Coördinaten om te converteren",
    "phto": "Geconverteerde coördinaten"
  },

  "revwherigo" : {
    "title": "Reverse Wherigo",
    "long": "<p>Oplossen van reverse wherigos (Waltmeister cartridge). Geef de drie getallen van elk 6 cijfers gescheiden door spaties of iets anders. De tool berekent het coördinaat.</p>"
  },

  "project": {
    "title": "Projecteren",
    "long": "Een projectie is een coördinaat dat zich op een gegeven afstand en hoek bevindt van een ander coördinaat. De afstand kan worden opgegeven in meter, kilometer, voet, yard en mijlen. De hoek kan worden opgegeven in graden, radialen en gon.",
    "projcoord": "Het geprojecteerde coördinaat is ",
    "startpoint": "Startpunt",
    "projpoint": "Geprojecteerde punt"
  },

  "mapmaker": {
    "title": "Kaart maken",
    "long" : "Plot een lijst van coördinaten met een marker en tekst op de kaart. Er kan eventueel een cirkel om de coördinaten worden getekend. Ideaal voor het vinden van mogelijk locaties voor een te plaatsen geocache of het vinden van een mystery cache. Het plaatsen van markers en tekst kan worden uitgezet.",
    "phcoord": "Coördinaten hier invoeren",
    "phlabel": "Labels hier invoeren",
    "showmark": "Toon markers",
    "showlabel": "Toon marker labels",
    "drawcircle": "Teken cirkels",
    "makemap": "Maak kaart",
    "error1": "Aantal coördinaten en labels moet gelijk zijn"
  },

  "dialogic": {
    "intro": "Vul het coordinaat in en vervang de ontbrekende cijfers door abcd (of een andere letter). Vul de mogelijke waardes in om te proberen. Maximaal 500 coordinaten.",
    "button": "Toon coördinaten",
    "error1": "Het maximale aantal coordinaten is 500. Beperk het aantal mogelijke waardes."
  },

  "lines": {
    "title": "Lijnen",
    "long" : "Bereken het middelpunt, lengte en richting van een lijn. Bereken het dichtsbijzijnde punt op een lijn gezien vanaf een ander punt. Bereken het snijpunt van twee lijnen. Berekende punten en lijnen worden getoond op kaart.",
    "calc1": "Bereken afstand, richting en middenpunt (gebruikt coördinaten 1 & 2)",
    "calc2": "Bereken punt het dichtste bij punt 3 op de lijn door punt 1 en punt 2.",
    "calc3": "Bereken het snijpunt van de lijn door punt 1 en punt 2 en de lijn door punt 3 en punt 4.",
    "midpoint": "Middenpunt",
    "distance": "De afstand is: ",
    "direction": "De richting is: ",
    "pointnearest": "Dichtstbijzijnde punt: ",
    "intersection": "Snijpunt: "
  },

  "incomplete": {
    "title": "Incomplete coördinaten",
    "long" : "Plot en berekenen mogelijke coördinaten waarvoor één tot vier cijfers ontbreken. Voor elk van de ontbrekende cijfers kunnen de beschikbare opties worden ingesteld. Er kunnen maximaal 500 locaties worden getoond op kaart. De gebruikte waardes worden getoond in een popup alsop het coördinaat wordt geklikt. De tool werkt met alle beschikbare coördinaatsystemen.",
    "error1": "Maximaal aantal coördinaten is 500. Reduceer het aantal opties."
  },

  "triangles": {
    "title": "Driehoeken",
    "long" : "Bereken het oppervlakte, omtrek, zwaartepunt, hoogtepunt, middelpunt ingeschreven cirkel, middelpunt omgeschreven circkel, negenpuntspunt van een driehoek. Berekende punten en driehoeken worden ook getoond op kaart.",
    "centroid": "Zwaartepunt",
    "orthocenter": "Hoogtepunt",
    "incenter": "Middelpunt ingeschreven cirkel",
    "circumcenter": "Middelpunt omgeschreven cirkel",
    "ninepoint": "Negenpuntspunt",
    "or": " of "
  },

  "circles": {
    "title": "Cirkels",
    "long" : "Bereken de snijpunten van twee cirkels en de oppervlakte van het gezamenlijke deel. Berekende punten en cirkels worden ook getoond op kaart.",
    "ip": "Snijpunt",
    "ia": "Oppervlakte snijvlak",
    "ni": "Geen snijpunten",
    "distance": "Afstand tussen snijpunten",
    "or": " of ",
    "surf": "Oppervlakte van cirkel ",
    "circ": "Omtrek van cirkel  "
  },

  "antipode": {
    "title": "Antipode",
    "long" : "Bereken de antipode, het punt exact aan de andere kant van de aardbol.",
    "result": "Het antipode coördinaat is ",
    "or": " of "
  },

  "w3w" : {
    "title": "What3words",
    "long": "<p>What3words vertaalt een coördinaat naar 3 woorden. Meerdere talen worden ondersteund. Er is ook een optie om suggesties te tonen op basis van incomplete of fout gespelde woorden. Bij het converteren naar een what3words coördinaat kan de taal worden geselecteerd. Bij het converteren van een what3words coördinaat is de taal niet relevant.</p><p>De automatische suggesties zijn iets lastiger. De resultaten kunnen worden beperkt tot een land. Gebruik hiervoor de twee-letter ISO code zoals NL of DE. De resultaten kunnen ook worden beperkt tot een cirkel rondom een gegeven coördinaat. Tenslotte kan ook een focus coördinaat worden opgegeven. Er worden maximaal 3 suggesties getoond, maar soms zijn er geen resultaten. Probeer diverse spellingen voor het beste resultaat.</p><p>Vanaf november 2024 is het niet langer mogelijk een coördinaat te converteren naar what3words. De gratis service is niet meer beschikbaar gesteld door what3words.com.</p>",
    "languages": "Beschikbare talen",
    "convertto": "Converteer naar w3w",
    "convertfrom": "Convert naar ...",
    "suggest": "Toon suggesties",
    "w3wcode": "What3words coordinaat",
    "w3wsugg": "What3words suggestie",
    "countries": "Beperk to land",
    "focus": "Focus op coördinaat",
    "clip": "Beperk tot cirkel",
    "words": "Woorden",
    "country": "Land",
    "nearest": "Dichtsbijzijnde plaats"
  },

  "tryanswers" : {
    "title" : "Probeer antwoorden",
    "answers" : "Eén antwoord per regel. Meerder opties scheiden door ",
    "formulas" : "Gebruik formules",
    "phformulas" : "1e antwoord is A, 2e is B enzovoorts. Bijv A+B. Eén formule per regel.",
    "long" : "<p>Elke geocacher kent het. Je hebt een aantal vragen te beantwoorden, wat formules in te vullen en daar moet een coördinaat uit rollen. Maar je bent niet zeker over de juiste antwoorden. En moet je nu de woordwaarde gebruiken of stapeltellen. Of misschien alleen de eerste letter, de laatste letter of toch de lengte van het antwoord. Eindeloos veel opies om te proberen. Dat kan makkelijker! Deze tool probeert alle opties en alle mogelijke berekeningen op de gegeven antwoorden.</p><p>Geef één antwoord per regel. Als er meerder opties zijn kan je die scheiden door een {'|'}. Als je formules wil gebruiken, vul dan één formule per regel in. Het eerste antwoord is A in de formule, het tweede B enzovoorts.</p>",
    "showdescr" : "Toon omschrijvingen",
    "showtable" : "Toon tabel",
    "onlysq": "Alleen stapeltellen (geen woordwaardes)",
    "tryleng": "Probeer lengte van het antwoord",
    "trycnts" : "Probeer diverse tellingen",
    "tryfirst" : "Probeer de 1e letter",
    "trylast" : "Probeer de laatste letter",
    "trysv" : "Probeer het Scrabble en Vanity alfabet",
    "trylang" : "Probeer andere talen",
    "tryrev" : "Probeer het omgekeerde alfabet (A=26, Z=1)",
    "tryzero" : "Probeer met starten op nul (A=0, Z=25)",
    "value" : "Waarde",
    "sq" : "Stapeltellen",
    "full": "Volledig antwoord",
    "first": "Eerste letter",
    "last": "Laatste letter",
    "rev": "Omgekeerd alfabet",
    "zero": "Alfabet start op 0",
    "finds": " antwoorden gevonden.",
    "length" : "Lengte",
    "words": "Aantal woorden",
    "chars": "Aantal tekens",
    "letters": "Aantal letters",
    "digits": "Aantal cijfers"
  },

  "wordvalue": {
    "title": "Woordwaarde",
    "long" : "Een tool voor het berekenen van woordwaarde en stapeltelling van een tekst en van elk woord in de tekst. Ondersteund diverse alfabetten zoals Grieks, Cyrillisch, Scrabble en telefoon. De telling kan ook in omgekeerde volgorde (bijv. Z=1 en A=26). De telling begint standaard met 1, maar kan ook met 0 beginnen (bijv. A=0 en Z=25). Vervang diakrieten indien gewenst, maar let erop dat in sommige alfabetten diakrieten een eigen letter vertegenwoordigen!",
    "reverse": "Omgekeerde volgorde Z→A",
    "startzero": "Begin met nul (A=0 of Z=0 indien omgekeerd)",
    "replacediac": "Vervang diakrieten",
    "showhide": "Toon/verberg alfabet",
    "someinfo": "Informatie over alfabetten",
    "someinfo2": "<p>Er wordt gerekend met de officiële alfabetten. In sommige talen zijn diakrieten aparte letters (zoals Ä in het Duits of Å in het Zweeds) en in sommige talen komen zij overeen met de originele letter (zoals é of ô in het Frans). <b>Vervang diakrieten</b> is echter genadeloos en vervangt alle diakrieten. Dat werkt goed in de meeste gevallen, maar niet voor talen waarbij deze letters deel zijn van het alfabet</p><p>De Griekse en Cyrillische alfabetten hebben letters die grote gelijkenis vertonen met de Westerse versies, zoals A of B. Maar ze zijn wel degelijk verschillend. Indien ingevoerd met een Westers toetsenbord komen ze niet overeen en krijgen een waarde 0. Indien je een Russische/Griekse tekst zou kopieren, bijvoorbeeld plaatsnamen van Wikipedia (zoals Амстердам) dan worden de juiste letters gebruikt en de berekening correct uitgevoerd.</p><p>De Scrabble waardes zijn die van de laatst bekende versies. Er zijn nog veel meer versies in omloop. Een goed overzicht is te vinden op <a href='https://en.wikipedia.org/wiki/Scrabble_letter_distributions'>Wikipedia</a>, maar je moet dan zelf de berekening uitvoeren.</p>"
  },

  "charcodes": {
    "title": "Karakter codes",
    "long" : "<p>Computers werken intern met nummers en niet met letters. Een nummer wordt vertaald naar een karakter met gebruikmaking van een zogenaamde codepage. De meest gebruikte is tegenwoordig <b>UTF8 en UTF16</b>. <b>ASCII</b> is ook nog veel gebruikt. Er zijn nog veel meer varianten in gebruik. Voor MS-DOS en Microsoft Windows zijn er diverse codepages met regionale karakters. <b>Alt codes</b> refereren naar het intypen van een nummer op het numerieke keypad om een karakter to selecteren uit een Microsoft codepage. Er is ook een Atari version van Ascii en IBM's eigen EBCDIC code.</p><p>In telegrafie werden codes ook gebruikt. Deze <b>Baudot and Murray codes</b> bestaan uit 5 bits (of gaatjes in een papertape). De tool kan ook deze codes vertalen. De Cyrillische versie genaamd MTK2 wordt ook ondersteund.</p>",
    "input": "Type invoer",
    "output": "Gewenste uitvoer",
    "someinfo": "Informatie over codepages",
    "someinfo2": "<p>Computers zijn binair, ze gebruiken alleen 0 en 1. Deze getallen kunnen natuurlijk ook worden omgezet naar decimaal, octaal of hexadecimaal. Deze tool accepteert ze allemaal en converteert desgewenst. De nummers worden gebruikt om het juiste karakter (glyph in nerd speak) op te zoeken in een codepage.</p><p>De allereerste codepage was ASCII en deze is nog steeds in gebruik. Het is nu een subset van UTF, en is ook een subset van de codepages die gebruikt werden in MS DOS en MS Windows. ASCII gebruikt slechts 7-bits (128 karakters). De codepages van Microsoft gebruiken 8 bits (zoals CP437, CP850, CP1252), 256 characters. Voor talen met andere karakters (Russich, Chinees, Oost Europese talen) moest een andere codepage gebruikt worden. Met de introductie van UTF kan dezelfde codepage gebruikt worden voor alle talen en ook voor emoji's ;-). <strong>Alt codes</strong>: afhankelijk van de versie van MS DOS of MS Windows en geïnstalleerde codepage kan door het intikken van getallen op het numerieke toetsenbord in combinatie met de Alt-toets en code worden ingevoerd, resulterend in een speciaal karakter.</p><p>Voor een geschiedenis van alle codepages zie <a href='https://en.wikipedia.org/wiki/List_of_information_system_character_sets'>Wikipedia's history of information system character sets</a> en <a href='https://en.wikipedia.org/wiki/Code_page'>Wikipedia codepages</a>.</p><p>In de tijden van telegraaf en telex werden er ook al binaire codes gebruikt zoals de Baudot code (ITA-1) en de Murray code (ITA-2). De tool converteert ook deze codes. De bits zijn normaal in de volgorde 54321, maar de omgekeerde volgorde 12345 komt ook voor. Er is ook een Cyrillische versie van de Murraycode genaamd MTK-2. Voor meer informatie <a href='https://en.wikipedia.org/wiki/Baudot_code>Wikipedia</a>.</p>"
  },

  "substcipher": {
    "title": "Slimme Substitutie",
    "long" : "Een tool om substitutie geheimschriften op te lossen met behulp van frequentieanalyse. Op basis van de frequenties in de gecodeerde tekst en die van de geselecteerde taal (Engels, Nederlands, Duits, Frans of Spaans) worden de beste matches voorgesteld. Specificeer de originele en de vervangende letters en de aangepaste tekst wordt getoond. De vervangen letters worden duidelijk gemarkeerrd. Eventueel kunnen de eerste 8 meest waarschijnlijke kandidaten automatisch worden vervangen.",
    "errorlength": "Origineel en substituten moeten dezelfde lengte hebben",
    "errordouble": "Dubbele letters gevonden.",
    "highlight": "Highlight",
    "orig": "Originele letters",
    "repl": "Substituten",
    "casesens": "Hoofdlettergevoelig",
    "get": "Hints ophalen",
    "apply": "Hints toepassen"
  },

  "analtxt": {
    "title": "Analiseer tekst",
    "long" : "Een tool om een tekst te analiseren. Telt het aantal zinnen, woorden, letters (hoofd- en kleine letters), cijfers, spaties en andere tekens. Geeft ook de percentages.",
    "analyze": "Analiseer tekst",
    "result": "Tabel met aantallen en percentages komt hier",
    "nwords": "Aantal woorden",
    "nlines": "Aantal regels",
    "nchar": "Aantal karakters",
    "nalpha": "Aantal letters (A to Z, a to z)",
    "ndigit": "Aantal cijfers (0 to 9)",
    "nwhite": "Aantal witgebruik (spaties, tabs, regeleinde)",
    "nupper": "Aantal hoofdletters (A to Z)",
    "nlower": "Aantal kleine letters (a to z)",
    "nnonalpha": "Aantal niet-letters",
    "nnonwhite": "Aantal niet-witgebruik",
    "letter": "Letter",
    "digit": "Cijfer",
    "symbol": "Symbool",
    "count": "Aantal",
    "perc": "Percentage",
    "upper": "hoofd",
    "lower": "kleine"
  },

  "texttonum": {
    "title": "Tekst naar nummers",
    "long" : "Een tool die tekst naar nummers vertaalt en vice versa op basis van de positie in het alfabet. Ondersteunt diverse alfabetten. Eventueel in omgekeerde volgorde en/of beginnend op nul. De voorloopnul bij getallen onder de 10 is optioneel, indien deze eenduidig kan worden weggelaten.",
    "leadzero": "Gebruik altijd een 0 voor getallen <10",
    "btnttn": "Tekst naar getallen",
    "btnntt": "Getallen naar tekst"
  },

  "keyboards": {
    "title": "Toetsenborden",
    "long" : "Een tool om tekst te vertalen alsof het op een ander toetsenbord was getikt. Ondersteund Azerty, Dvorak, Cyrillisch en Colemak.",
    "inputkb": "Invoer toetsenbord",
    "outputkb": "Uitvoer toetsenbord",
    "error": "Toetsenbord kan niet worden geconverteerd. Controleer de invoer."
  },

  "texttoss": {
    "title": "Hussel",
    "long": "Verander de volgorde van de letters van elk woord in een tekst. De optie met behoud van de eerste en laatste letter van elk woord heet ook wel typoglycemia.",
    "mode": "Selecteer wijze van woorden husselen",
    "mode3": "Behoud de eerste en de laatste letter (typoglycemia)",
    "mode2": "Behoud alleen de eerste letter",
    "mode1": "Hussel alle letters"
  },

  "textchunks": {
    "title": "Text blokken",
    "long": "<p>Hakt een tekst in rijen of kolommen van gelijke lengte om verborgen patronen te onthullen. Geef een begin en eindgrootte op om meerdere mogelijkheden te onderzoeken. Ga op zoek naar herhalende letters, cijfers of symbolen in de ingedeelde tekst.</p><p>Bijvoorbeeld een schijnbaar random string van 0 en 1 kan na herindeling een patroon laten zien.</p>",
    "dir": "Richting",
    "start": "Blok grootte start",
    "end": "Blok grootte end",
    "ignore": "Negeer spaties",
    "upper": "Alles hoofdletters"
  },

  "baseconv": {
    "title": "Base conversie",
    "long" : "Een tool voor conversie van één getalstelsel naar een ander. Converteert vanaf base 2 (binair) tot en met base 36. De gebruikte symbolen zijn standaard 0-9A-Z maar kunnen eventueel worden aangepast, bijv. + en - voor binair of A t/m J voor decimaal. Meerdere nummers kunnen tegelijk worden ingevoerd gescheiden door spaties. Binair is base 2, octaal is base 8, decimaal is base 10 en hexadecimaal is base 16.",
    "from": "Van",
    "to": "Naar",
    "symbolserr": "Aantal symbolen moet overeenkomen met grondtal of leeg zijn."
  },

  "digits": {
    "title": "Decimalen",
    "long" : "<p>Een tool om de decimalen van 𝜋, e, 𝜏, φ, γ, √2, √3 en ζ(3) te zoeken. De eerste decimaal achter de punt is positie 1. De eerste 1,000,000 decimalen zijn beschikbaar.</p><p>Alle getallen zijn irrationeel. Dit impliceert dat elke opvolging van nummers vroeg of laat voorkomt tussen de decimalen. De volgende getallen zijn beschikbaar. Pi of 𝜋. Het natuurlijke getal e. Tau of 2𝜋. De gouden ratio of φ of phi. De Euler-Mascheroni constante of γ. De wortels van 2 en 3 (√2 en √3). De constante van Apéry of ζ(3) of zeta(3). De constanten van Gauss en Catalan, allebei soms ook aangeduid als G. De constante van Catalan.</p>",
    "sel": "Selecteer een nummer",
    "pi": "π of pi, begint met 3.141592653589...",
  	"e": "e, begint met 2.718281828459...",
    "tau": "𝜏, tau of 2*π, begint met 6.2831853071...",
    "phi": "φ of phi of de gulden ratio, begint met 1.61803398874989...",
    "euler": "γ of de Euler–Mascheroni constante, begint met 0.577215664901...",
    "sq2": "√2 of constante van Pythagoras, begint met 1.414213562373095...",
    "sq3": "√3 of constante van Theodorus, begint met 1.7320508075...",
    "zeta3": "ζ(3) of zeta(3) of Constante van Apéry, begint met 1.202056903...",
    "gauss": "Constante van Gauss, begint met 0.8346268416...",
    "lemni": "Lemniscate constante, begint met 5.2441151085...",
    "cat": "Catalan constante, begint met 0.915965594...",
    "champ": "Champernowne constante, begint met 0.12345678910111213...",
    "from": "Vanaf decimaal",
    "to": "tot decimaal",
    "get": "Haal op",
    "res1": "De decimalen vanaf ",
    "res2": "tot",
    "res3": "zijn"
  },
  
  "primes" : {
    "title": "Priemgetallen",
    "long" : "Een tool die controleert of een getal priem is of niet. Het maximum nummer is 2^53 wat kan worden gecontroleerd. De tool toont het priemgetal op de gegeven positie of geeft de positie van een gegeven priemgetal. De eerste 865.000 priemgetallen zijn beschikbaar.",
    "check": "Check priem of niet",
    "pos": "Priemgetal op positie",
    "primepos": "Positie van priemgetal",
    "primefact": "Priemfactoren van",
    "toobig": "Nummer is te hoog",
    "isprime": "is een priemgetal",
    "isnotprime": "is geen priemgetal",
    "primeatpos": "Het priemgetal op positie",
    "primeis": "is",
    "primenotfound": "Priemgetal is niet gevonden",
    "posofprime": "De positie van priemgetal"
  },

  "romans" : {
    "title": "Romeinse getallen",
    "long": "Een tool die Romeinse getallen converteert naar normale getallen en andersom. Het maximale Romeins getal is 3999. Romeinse getallen bestaan uit de volgende letters MDCLXVI. Het is mogelijk meerdere getallen tegelijk in te voeren gescheiden door spaties of iets anders.",
    "btndtr": "Decimaal naar Romeins",
    "btnrtd": "Romeins naar Decimaal",
    "notroman": "Ongeldig Romeins getal, alleen MDCLXVI zijn toegestaan",
    "invalidint": "Ongeldig getal, het maximale Romeinse getal is 3999"
  },

  "fibonacci": {
    "title": "Fibonacci",
    "long" : "De Fibonacci reeks begint met 1, 1. Het volgende nummer is steeds de som van de voorgaande twee. Dus 1+1=2, 1+2=3, 2+3=5 enzovoorts. De nummers worden zeer snel zeer groot. De eerste 500 Fibonacci nummers zijn beschikbaar.",
    "pos": "Fibonacci nummer op positie",
    "check": "Controleer of dit een Fibonacci nummer is",
    "toobig": "Positie te hoog (max 500)",
    "errorzero": "Positie moet groter dan 0 zijn",
    "the": "Het ",
    "nth": "e Fibonacci nummer is ",
    "not": " niet",
    "fib": " is een Fibonacci nummer op positie "
  },

  "gcdandlcm": {
    "title": "GGD en KGV",
    "long" : "Deze tool berekent de Grootste Gemene Deler (GGD) en het Kleinste Gemene Veelvoud (KGV). Het geeft tevens de priemfactoren van elk getal. Let op want voor zeer grote getallen kan de berekening flink wat tijd kosten.",
    "num": "Nummers",
    "inperror": "Ongeldige invoer, nummer moet groter dan 0 zijn",
    "t1": "Grootste Gemene Deler (GGD) & Kleinste Gemene Veelvoud (KGV)",
    "t2": "Priemfactoren",
    "gcd": "De GGD is ",
    "lcm": "Het KGV is"
  },

  "formulasolver": {
    "title": "Cryptaritme",
    "long": "<p>Cryptaritmes, alphametics or letter rekenenen. Het oplossen van formules waar cijfers vervangen zijn door letters, zoals CHECK + THE = TIRES. Nummers zijn standaard uniek (d.w.z. voor elk nummers is er één letter). De berekeningen zijn decimaal. Dit kan eventueel worden aangepast, maar dat zal zelden nodig zijn.</p><p><b>Let op:</b> Het genereren en berekenen van alle mogelijke formules kan afhankelijk van de snelheid van de computer, redelijk wat tijd kosten. Heb geduld.</p>",
    "formula": "Formule",
    "unique": "Nummers zijn uniek",
    "base": "Getalstelsel",
    "nosol": "Er zijn geen oplossingen",
    "exprerror": "Fout bij het evalueren van de expressie. Controleer de formule.",
    "toomanyvars": "Te veel variabelen, verhoog getalstelsel of pas de formule aan."
  },

  "nimbers": {
    "title": "Nimbers",
    "long" : "Een tool om de som (+) en het product (*) van twee nimbers te berekenen. Nimbers zijn geen nummers, maar je kan ze wel optellen en vermenigvuldigen. Nimbers worden gebruikt in combinatorial game theory (CGT). Voer twee getallen in en het product en de som worden berekend.",
    "num1": "Eerste nummer",
    "num2": "Tweede nummer",
    "t1": "Product & som",
    "prod": "Het nimber product is",
    "sum": "De nimber som is"
  },
  
  "bignumbers": {
    "title": "Giganummer calculator",
    "long": "<p>Een rekenmachine voor heel erg grote getallen. Werkt alleen met gehele getallen. Er kan gerekend worden met decimaal, binair, octaal of hexadecimaal getallen. Alle operaties werken zoals je mag verwachten, behalve delen. Bij delen wordt niet afgerond, maar de decimalen worden afgekapt. Alle logische operaties werken bit voor bit</p>",
    "selnum": "Rekenstelsel",
    "num1": "Getal A",
    "num2": "Getal B",
    "decimal": "Decimaal",
    "binary": "Binair",
    "octal": "Octaal",
    "hexadecimal": "Hexadecimaal",
    "arithmetic": "Rekenkundige bewerkingen",
    "logical": "Logische bewerkingen"
  },

  "combinations": {
    "title": "Combinaties",
    "long": "Bereken het aantal en genereer combinaties (de volgorde doet er niet toe) of permutaties (de volgorde doet er wel toe).",
    "cnt": "Aantal te kiezen items",
    "size": "Aantal items om uit te kiezen",
    "rpt": "Vervanging toegestaan (hergebruik opties)",
    "sel": "Combinaties of permutaties",
    "set": "Selecteer items uit",
    "set1": "Cijfers vanaf 1",
    "set2": "Letters vanaf A",
    "set3": "Lijst van items",
    "list": "Lijst van items",
    "cntcomb": "Aantal combinaties",
    "cntperm": "Aantal permutaties",
    "gencomb": "Genereer combinaties",
    "genperm": "Genereer permutaties",
    "notenoughitems": "Niet genoeg items in de lijst",
    "toomany": "Teveel om te berekenen",
    "numcomb": "Het aantal combinaties is ",
    "numperm": "Het aantal permutaties is ",
    "max": "Maximum aantal dat kan worden gegenereerd is "
  },

  "equations": {
    "title": "Vergelijkingen",
    "long": "Oplossen van een stelsel lineaire vergelijkingen. Input kan decimaal zijn of breuken, bijv. 1.5 of 3/2 of 1 1/2 zijn hetzelfde.",
    "numvar": "Aantal variabelen",
    "output": "Output formaat",
    "fractions": "Breuken",
    "decimals": "Decimalen",
    "nosol": "Er zijn geen oplossingen."
  },

  "palindrome": {
    "title": "Palindroom",
    "long" : "Een palindroom getal is hetzelfde als het van rechts naar links wordt gelezen. De tool berekent hoeveel herhalingen nodig zijn om van een nummer een palindroom te maken, door er steeds het omgekeerde getal bij op te tellen. Voor de meeste getallen is dit opvallend weinig, maar sommige getallen duren aanzienlijk langer. Het algortime stopt na 100 herhalingen.",
    "t1": "Palindroom",
    "res1": "Het duurt",
    "res2": "herhalingen om een palindroom te worden.",
    "res3": "De reeks is",
    "toomany": "Meer dan 100 iteraties"
  },

  "numberprop": {
    "title": "Eigenschappen van nummers",
    "long" : "Eigenschappen van een nummer. Het maximum nummer is 1,000,000,000. Priem, fibonacci, evil, odious, lucky, perfect, aspiring, deficient, squarefree, composiet en meer.",
    "num": "Nummer",
    "t1": "Eigenschappen",
    "even": "Even: nummers deelbaar door 2",
    "odd": "Oneven: nummers niet deelbaar door 2",
    "prime": "Priem: Een natuurlijk getal groter dan 1 dat niet het product is van twee andere natuurlijke getallen",
    "fib": "Fibonacci: Reeks, elk nummer is de som van de voorgaande twee nummers. De reeks begint met 1, 1, 2, 3, ...",
    "comp": "Composiet: Nummers waarvoor geldt n = x*y met x > 1 en y > 1 (niet priem getallen)",
    "bi": "Bipriem: Nummers die het product zijn van exact twee priemgetallen",
    "niven": "Niven or Harshad: Nummers deelbaar door de som van de cijfers",
    "sqfree": "Squarefree: Nummers niet deelbaar door een kwadraat > 1",
    "evil": "Evil: Het binaire getal heeft een even aantal enen.",
    "odious": "Odious: Het binaire getal heeft een oneven aantal enen",
    "perfect": "Perfect: Sigma(n) = 2n, met sigma(n) is de some van de delers van n",
    "defi": "Deficient: Sigma(n) < 2n, met sigma(n) is de some van de delers van n",
    "abun": "Abundant: Sigma(n) > 2n, met sigma(n) is de some van de delers van n",
    "narc": "Narcistic: Som van de cijfers ** (aantal cijfers) is gelijk aan n",
    "pow": "Powerful: Voor elk priemgetallen p dat een deler is van n geldt dat p**2 ook een deler is van n",
    "lucky": "Lucky: zie https://en.wikipedia.org/wiki/Lucky_number voor uitleg",
    "happy": "Happy: zie https://en.wikipedia.org/wiki/Happy_number voor uitleg",
    "asp": "Aspiring: zie https://oeis.org/A063769 Online Encyclopedia of Integer Sequences voor uitleg",
    "penta": "Pentagonal: een getal in de reeks a(n) = n*(3*n-1)/2",
    "toobig": "Nummer moet kleiner zijn dan 1,000,000,000"
  },

  "sequences": {
    "title": "Reeksen",
    "long" : "Een tool om de n-de term te berekenen van enkele bekende reeksen zoals Conway, Hailstone, Golomb and Niven. Dit zijn slechts enkele van de tienduizenden gedocumenteerde reeksen van gehele getallen. Voor ontbrekende reeksen, probeer de <a href='http://oeis.org'>Online Encyclopedia of Integer Sequences</a>. OEIS kan zoeken op woorden, maar ook op de eerst termen van een reeks.",
    "sel": "Selecteer een reeks",
    "conway": "Conway reeks ook wel bekend als de hoor-en-spreek reeks",
    "revconway": "Reverse Conway reeks ook wel bekend als de hoor-en-spreek reeks",
    "hailstone": "Hailstone reeks, als n even n/2, als n oneven 3n+1",
    "niven": "Niven, nummers deelbaar door de som van de cijfers",
    "abundant": "Abundant, nummers waarvoor de som van de delers groter is dan het nummer",
    "deficient": "Deficient, nummers waarvoor de soms van de delers kleiner is dan het nummer",
    "golomb": "Golomb, de n-de term is gelijk aan het aantal keren dat n voorkomt in de reels",
    "niter": "Aantal herhalingen",
    "start": "Startwaarde",
    "res1": "Het getal op positie",
    "res2": "De reeks is",
    "maxconway" : "Het maximum voor Conway is 50"
  },

  "brainfuck": {
    "title": "Brainfuck",
    "long":  "<p>Brainfuck is een esoterische programmeertaal (esolang) die met opzet totaal onleesbaar is. Er zijn slechts 8 commando's + - > < . , [ en ]. De d, i, l en r vervangen soms de commandos '+, -, < en >. De verkorte notatie gebruikt nummers die het voorgaande commando herhalen.</p><p>Ook! is gelijk aan Brainfuck maar elke commando is vervangen door oerang oetang geluiden. Spoon is een derde variant waarbij een ondubbelzinnige combinatie van 0 en 1 wordt gebruikt. Er zijn nog veel meer zogenaamde <a href='https://esolangs.org/wiki/Trivial_brainfuck_substitution'>trivial Brainfuck substituties</a>. Enkele kunnen hier ook worden uitgevoerd.</p>",
    "vars" : "Selecteer programmeertaal",
    "shorthand" : "Verkorte notatie",
    "code": "Programmacode",
    "input": "Input variabelen",
    "run": "Run code",
    "debug": "Debug info naar console"
  },

  "deadfish" : {
    "title": "Deadfish",
    "long":  "<p>Deadfish is een programmeertaal met slechts 4 instructies (idso). Optellen met 1 (i), aftrekken met 1 (d), kwadraat (s) en output (o). De teller begint op 0. Als de teller -1 of precies 256 is reset de teller naar 0. Soms worden xdkc gebruikt in plaats van idso. Beide varianten worden ondersteund.</p>"
  },

  "cow" : {
    "title": "Cow",
    "long": "<p>De COW programmeeertaal is bedacht door Sean Heber in 2003. Het is een humoristische Brainfuck variant speciaal bedoeld voor koeien. COW heeft twaalf instructies (vier meer dan Brainfuck) en is Turing-compleet. De meeste instructies zijn moos (in Engeland zeggen koeien moo), waarbij alleen de hoofdletters, kleine letters veranderen: mOo, moO, mOO, Moo, enzovoorts. De uitzonderingen zijn MMM, OOO, oom en OOM. Alle andere input is genegereerd als commentaar. De debug optie schrijft informatie tijdens de uitvoering van het programma naar de Developers console van de browser. Zo kan de code gecontroleerd worden.</p>"
  },

  "beatnik": {
    "title": "Beatnik",
    "long": "Beatnik berekent de Scrabble waarde van elk woord. De waarde is het commando dat wordt uitgevoerd. Woorden bestaan alleen uit letters, dus Boeing787Dreamliner geeft twee woorden (en dus twee commando's). Er zijn meerdere Scrabble versies beschikbaar, maar Engels is de meest waarschijnlijke keuze. Meer info is te vinden op <a href='https://esolangs.org/wiki/Beatnik'>Esolangs</a>.</p><p>De debug optie schrijft informatie tijdens de uitvoering van het programma naar de Developers console van de browser. Zo kan de code gecontroleerd worden.</p>"
  },

  "bcd": {
    "title": "BCD",
    "long":  "<p>BCD (Binary Coded Decimals) is een manier om getallen te coderen. Standaard worden alle cijfers binair weergegeven, dus 4571 wordt 0100  0101 0111 0001. Deze worden soms gecombineerd in groepen van 8 digits. Het voorbeeld wordt dan 01000101 01110001. Of soms aangevuld tot 8 digits, 11110100 11110101 11110111 11110001.</p><p>Er zijn ook andere manier om te coderen zoals Aiken, Excess-3, Excess-6, Glixon en diverse Gray codes. Elke cijfer wordt nog steeds met 4 bites gecodeerd, maar in in plaats van binair wordt een andere codering gebruikt. Meer info is <a href='https://en.wikipedia.org/wiki/Binary-coded_decimal'>hier</a> te vinden.",
    "seltype": "Selecteer methode",
    "bcdfrom": "BCD naar numbers",
    "bcdto": "Nummers naar BCD",
    "packed": "Packed BCD",
    "fill": "Aanvullen met"
  },

  "bintotext": {
    "title": "Binary encoding",
    "long": "<p>Binaire naar text encodings converteren elk byte (8 bits) van de input naar iets leesbaars. Dit is zorgt ervoor dat binaire data via mail of andere protocollen getransporteerd kan worden. Dit is met name bruikbaar voor het verzenden van afbeeldingen, videos of willekeurig andere files die anders in transmissie corrupt raken. Base64 is op dit moment de meest gebruikte encoding. Deze tool ondersteunt base64, base32, Bitcoin, Ripple, ascii85, uuencode en base16.</p><p>Carriage returns en linefeeds worden standaard verwijderd uit de invoer, dit is gebruikelijk voor binary encoding. Spaties blijven bewaard (behalve voor tekst, binaire, decimale en hexadecimale invoer). Binaire, decimale and hexadecimale invoer is precies 1 nummer. Spaties kunnen worden gebruikt voor leesbaarheid maar worden verder genegeerd. Dus 123 123 is hetzelfde als 123123. En 3A B4 is het hexadecimale number 3AB4. </p>",
    "selfrom": "Encoding van",
    "selfromtable": "Encoding table",
    "selto": "Encoding naar",
    "seltotable": "Encoding table"
  },

  "duckspeak" : {
    "title": "Duckspeak",
    "long": "Duckspeak klinkt alsof een eend loopt te kwaken. De invoer is hexadecimaal (0-9A-F) waarbij elke getal wordt omgezet naar eendentaal. De invoer kan ook tekst of getallen (kleiner dan 256) zijn. Decoderen doet het omgekeerde.",
    "invalidint": " is een ongeldig getal\n",
    "format": "Invoer/uitvoer formaat",
    "ascii": "Tekst (ASCII)",
    "hex": "Hexadecimaal",
    "dec": "Getallen (decimaal",
    "invalidcmd": " is geen duckspeak\n"
  },

  "checksum": {
    "title": "Controlegetal",
    "long": "<p>Controlecijfers worden gebruikt om te controleren of een nummer geldig is. Hierdoor kunnen bijvoorbeeld typefouten worden gedetecteerd. Er zijn diverse manieren om een controlecijfer te berekenen. Controlegetallen worden gebruikt in credit card nummers, bankrekeningen, BSN (burgerservicenummer), artikel codes, ISBN nummers en nog veel meer.</p><p>In de meeste gevallen is het controlecijfer het laatste cijfer. Je kan het weglaten of vervangen door een vraagteken. In IBAN nummers is het controlegetal de 3e en 4e positie. Vervang deze bij het invoeren atlijd door vraagtekens, bijv. NL??ABNA0373510122.",
    "checkres": "Het controlegetal is: ",
    "checkmethod": "Methode",
    "checkpar1": "0 (even parity) of 1 (oneven parity)",
    "checkpar2": "1 (even parity) of 0 (oneven parity)"
  },

  "truthtable": {
    "title": "Waarheidstabel",
    "long": "Deze tool maakt een zogenaamde waarheidstabel. Voor alle mogelijke variabelen (waar, niet waar) wordt het resultaat van de logische expressie (waar, niet waar) berekend.  Elke tekst anders dan and, or, xor of not wordt gezien als een variabele. In plaats van and, or, not kunnen ook symbolen uit programmeertalen (&&, {'||'} en !) de algabraische notatie (*, + en !) of de notatie volgens propositielogica (∧, ∨ en ¬) worden gebruikt. Alhoewel incorrect kunnen de notaties ook door elkaar worden gebruikt.",
    "expr": "Boolean expressie"
  },

  "encryption": {
    "title": "Encryptie",
    "long": "<p>In feite zijn dit allemaal zeer complexe geheimschriften (cijfers) die door computers worden gebruikt om informatie veilig op te slaan en te verzenden. Het zijn de opvolgers van de handcijfers uit de 20e eeuw en daarvoor. Alle encyrpties hebben tenminste een sleutel nodig. Er zijn opties beschikbaar om de uitvoering van de algoritmes te beïnvloeden, maar het zal vrijwel altijd volstaan om de standaard instellingen te gebruiken.</p><p>DES was voor lange tijd de standaard, maar is door zijn korte sleutel inmiddels goed te kraken. AES is tegenwoordig het meest gebruikt. Rabbit, HMAC en RC4 worden ook gebruikt. Okto3 codeert de invoer naar een serie decimale getallen en is nutteloos, behalve misschien voor geocaches.</p>",
    "codes": "Kies een encryptie",
    "key": "Sleutel",
    "coded": "Gecodeerd bericht",
    "advanced": "Geavanceerde opties",
    "modes": "Mode",
    "padding": "Padding",
    "keytooshort": "Sleutel voor Okto3 moet tenminste 10 karakters zijn"
  },
    
  "hashes": {
    "title": "Hashes",
    "long": "<p>Hashes zijn een soort van digitale handtekening. Ze werken maar één kant op. De hash van het oorspronkelijke bericht wordt berekend en samen met het bericht verstuurd. De echtheid van het bericht kan vervolgens worden gecontroleerd door de hash opnieuw te berekenen en te vergelijken met de meegesturude hash. De hash wordt hier getoond als een hexadecimale string. MD5 is al lange tijd in gebruik, maar wordt nu als onveilig gezien. SHA-1 is nu de meest gebruikte hash. SHA-3 is de laatste en meest veilige versie. Andere hashes zijn SHA-2 (SHA256 en SHA512) en RIPEMD160.</p><p>Voer het bericht in en klik op Bereken om de hash te tonen. Indien er een hash ingevoerd is om te controleren dan wordt het resultaat van de controle ook getoond.</p>",
    "hashes": "Selecteer hash",
    "hash": "Hash verschijnt hier",
    "verify": "Tik een hash hier om het bericht te verifiëren",
    "errorok": "Hash is correct, bericht is oké",
    "errornok": "Hash is incorrect, bericht is corrupt"
  },

  "dialogabout": {
    "info": "Deze pagina is helaas alleen beschikbaar in het Engels."
  },

  "dialoghowto": {
    "info": "Deze pagina is helaas alleen beschikbaar in het Engels."
  },

  "numerology": {
    "title" : "Numerologie",
    "long" : "<p>Numerologie codeert volgens een bepaald systeem van versleutelen van het alfabet een woord of naam of datum, en herleidt dat tot een getal. Elke letter krijgt een waarde- De waardes zijn niet gerelateerd aan de positie in het alfabet (zoals met woordwaarde), maar met een symbolische waarde.</p><p>Het standaard Latijnse alfabet wordt meestal gebruikt. Gematria gebruikt het Hebreewse alfabet. Isopsephy het Griekse alfabet. </p>",
    "selmethod" : "Selecteer methode",
    "res1" : "De numerologische waarde is ",
    "res2" : "Berekening :",
    "err1" : "Eén of meerdere onbekende letters gevonden."
  },

  "datecalc" :{
    "title" : "Datum rekenen",
    "long" : "Bereken het aantal dagen tussen twee data. Tel een aantal dagen op of trek een aantal dagen af van een datum. Bereken de dag van de week of de dag in het jaar. Bereken het aantal dagen in het jaar en in de maand van een gegeven datum.",
    "date1" : "Eerste date",
    "date2" : "Tweede date",
    "days" : "Dagen optellen of aftrekken",
    "res1a" : "Het aantal dagen tussen de eerste en tweede datum is ",
    "res1b" : " dagen.",
    "res2a" : "Tel ",
    "res2b" : " dagen op bij de eerste datum ",
    "res3a" : "Trek ",
    "res3b" : " dagen af van de eerste datum ",
    "res4" : "De dag van de week is ",
    "res5" : "Het aantal dagen in het jaar ",
    "res6" : "Het aantal dagen in de maand ",
    "res7" : "Dag in het jaar "
  },

  "randomizer" : {
    "title" : "Random Generator",
    "long" : "<p>De random generator genereert een willekeurige reeks cijfers of tekens. Dit kan handig zijn om een bericht tussen te verstoppen. Maar het kan ook handig zijn voor spelletjes, simulaties of voor statistiek. Binair genereert een reeks met enkel 0 of 1. Tekst genereert een reeks uit het gegeven alfabet. Bereik genereert getallen tussen het opgegeven minimum en maximum. Verzameling genereert een reeks aan de hand van de gedefinieerde verzameling (gescheiden door komma's). ASCII tenslotte genereert een reeks uit alle printbare tekens.</p>",
    "sel" : "Selecteer methode",
    "selbin": "Binair (0 en 1)",
    "selrng": "Bereik",
    "seltxt": "Tekst",
    "selcol": "Verzameling",
    "selascii": "Alle printbare tekens (ASCII)",
    "numberof": "Aantal random",
    "minmax": "Min en max voor bereik",
    "chars": "Alfabet voor tekst",
    "coll": "Verzameling (komma geschieden)",
    "sep": "Tussenvoegsel",
    "sepnone": "Geen",
    "sepspace": "Spatie",
    "sepcomma": "Komma",
    "sepcolon": "Dubbele punt",
    "sephyphen": "Streepje" 
  },

  "rotciphers" : {
    "title": "Rotatie cijfers",
    "long": "<p>Rotatie cijfer vervangen simpelweg elke letter met een andere een paar posities verderop in het alfabet. Als je aan het einde komt, begin je weer aan het begin, vandaar de naam rotatie cijfers. Standaard is de verschuiving de helft van de lengte van het alfabet. In dat geval zijn coderen en decoderen namelijk gelijk. ROT13 gebruikt het standaard alfabet (hoofdletters). ROT5 werkt met enkel getallen. ROT47 met alle printbare ascii tekens.</p><p>De tool genereert alle mogelijke verschuivingen, zodat het makkelijk is de code te kraken als de verschuiving onbekend is. Overigens wordt ROT13 gebruikt door geocaching.com op de hints te coderen.</p>",
    "rot5" : "Getallen (ROT5)",
    "rot13": "Standaard (ROT13)",
    "rot47": "Printbare ASCII (ROT47)"
  },
  
  "freqanal" : {
    "title" : "Frequentie Analyse",
    "long" : "<p>Frequentie analyse is een belangrijk hulpmiddel in het kraken van codes. Voor simpele codes is de de meest voorkomende code meestal de meest voorkomende letter. Maar ook voor complexere codes is dit een handige tool. Hoe langer de tekst hoe betrouwbaarder de analyse.</p><p>Lengte 1 geeft de verdeling van de letters in het alfabet. Als deze een beetje overeenkomt met een normale tekst dan is dit vermoedelijk een 1 op 1 omzetting. Gebruik <a href='/substcipher'>Slimme Substitutie</a> om deze code te kraken.</p><p>Lengte 2, zogenaamde digrams of bigrams, is handig om codes te kraken die twee letters gebruiken om één teken te coderen, zoals de Polybius cijfer. Ook voor codes die twee letters, zoals Bazeries of Foursquare, per keer coderen is een analyse van bigrams handig. De gevonden verdeling komt dan overeen met de meest voorkomende verdeling van bigrams. Zo is EN in het Nederlands het meest voortkomende bigram.</p><p>Het maximale aantal getoonde missende n-grammen is 1000.</p>",
    "size" : "Lengte n-gram",
    "slide" : "Verschuif (ABCDE => AB, BC, CD, DE)",
    "bound" : "Analyseer losse woorden",
    "showmissing" : "Toon ontbrekende n-grams (max 1000)",
    "numfound" : "Aantal gevonden n-grams: ",
    "nummissing" : "Aantal ontbrekende n-grams: ",
    "missing": "Ontbrekende n-grammen"
  },

  "printlog" : {
    "title": "Logrollen maken",
    "long" : "Een handige tool voor het maken van logrollen. Stel het aantal kolommen in, stel het aantal regels per log in, voeg afbeeldingen, voeg FTF toe, kies kleuren en sla op als PDF. Afdrukken op A4 - 2 kolommen van 9cm zijn geschikt voor petlings - 5 kolommen van 3.6cm zijn geschikt voor fotorolletjes - 9 kolommen van 2 cm passen overal in. Sla op als PDF of als PNG.",
    "header": "Kopregel",
    "ncol": "Aantal kolommen",
    "lpl" : "Regels per log",
    "hdrcol": "Kopregelkleur",
    "txtcol" : "Tekstkleur",
    "linecol" : "Lijnkleur",
    "ftfcol" : "FTF kleur",
    "extra" : "Extra opties",
    "showimg" : "Afbeelding toevoegen",
    "selimg" : "Kies afbeelding",
    "nmdttm" : "Naam, datum, tijd",
    "printftf" : "Print FTF, STF en TTF",
    "savepdf" : "PDF opslaan",
    "savepng" : "PNG opslaan",
    "lh" : "Regelhoogte",
    "lh1": "Erg krap",
    "lh2": "Krap",
    "lh3": "Normaal",
    "lh4": "Ruim",
    "lh5": "Erg ruim"
  },

  "gameoflife": {
    "title": "Game of life",
    "long": "<p>Game of Life is een cellulaire automaat ontworpen door de Britse wiskundige John Horton Conway in 1970. Het begint met een startgeneratie van cellen. Elke volgende generatie ontstaat door een paar simpele regels. Een cel met minder dan 2 of meer dan 3 buren sterft. Een cel met precies 3 buren komt tot leven. </p><p>Selecteer het startpatroon voor de eerste generatie. Het is altijd mogelijk om cellen tot leven te wekken of te elimineren door erop te klikken. Desgewenst kunnen de default regels nog worden aangepast.</p>",
    "newgrid": "Start nieuw",
    "step": "Volgende",
    "gen": "Generatie: ",
    "cellsalive": "Aantal levende cellen:",
    "fillgrid": "Start patroon",
    "chgrules": "Aangepaste regels",
    "diebelow": "Sterft onder",
    "dieabove": "Sterft boven",
    "bornabove": "Leeft boven",
    "bornbelow": "Leeft onder",
    "empty": "Leeg",
    "random": "Willekeurig",
    "rndsym": "Willekeurig symetrisch",
    "rows": "# rijen",
    "cols": "# kolommen"
  },

  "booksearch" : {
    "title" : "Zoek een boek",
    "long" : "Zoek een boek op titel, auteur, ISBN nummer of een combinatie van deze. De online database van OpenLibrary.org wordt gebruikt. Als er meerdere matches zijn wordt alles getoond",
    "sel" : "Resultaten",
    "short": "Auteur, titel, één ISBN",
    "extra": "Auteur(s), title, alle ISBN, jaar van publicatie, talen, uitgevers",
    "bkfnd": "Aantal boeken gevonden: ",
    "author": "Auteurs(s): ",
    "titles": "Titel: ",
    "firstpub": "Jaar van eerste uitgifte: ",
    "lang": "Taal: ",
    "pub": "Uitgever(s): ",
    "edcnt": "Aantal edities: "
  }
  
}
